Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
/*
** ###################################################################
**     Compilers:           ARM Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**
**     Reference manual:    MKW2xDxxxRM Rev.0 Draft D February 2013
**     Version:             rev. 1.0, 2014-01-24
**
**     Abstract:
**         This header file implements peripheral memory map for MKV46F15
**         processor.
**
**     Copyright: 1997 - 2014 Freescale, Inc. All Rights Reserved.
**
**     http:                 www.freescale.com
**     mail:                 support@freescale.com
**
**     Revisions:
**     - rev. 1.0 (2014-01-24)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file MKV46F15.h
 * @version 1.0
 * @date 2014-01-24
 * @brief Peripheral memory map for MKV46F15
 *
 * This header file implements peripheral memory map for MKV46F15 processor.
 */


/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(MCU_MKV46F15)  /* Check if memory map has not been already included */
#define MCU_MKV46F15

/* Check if another memory map has not been also included */
#if (defined(MCU_ACTIVE))
  #error MKV46F15 memory map: There is already included another memory map. Only one memory map can be included.
#endif /* (defined(MCU_ACTIVE)) */
#define MCU_ACTIVE

#include <stdint.h>

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100u
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000u

/**
 * @brief Macro to calculate address of an aliased word in the peripheral
 *        bitband area for a peripheral register and bit (bit band region 0x40000000 to
 *        0x400FFFFF).
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return  Address of the aliased word in the peripheral bitband area.
 */
#define BITBAND_REGADDR(Reg,Bit) (0x42000000u + (32u*((uint32_t)&(Reg) - (uint32_t)0x40000000u)) + (4u*((uint32_t)(Bit))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 32bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG32(Reg,Bit) (*((uint32_t volatile*)(BITBAND_REGADDR(Reg,Bit))))
#define BITBAND_REG(Reg,Bit) (BITBAND_REG32(Reg,Bit))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 16bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG16(Reg,Bit) (*((uint16_t volatile*)(BITBAND_REGADDR(Reg,Bit))))
/**
 * @brief Macro to access a single bit of a peripheral register (bit band region
 *        0x40000000 to 0x400FFFFF) using the bit-band alias region access. Can
 *        be used for peripherals with 8bit access allowed.
 * @param Reg Register to access.
 * @param Bit Bit number to access.
 * @return Value of the targeted bit in the bit band region.
 */
#define BITBAND_REG8(Reg,Bit) (*((uint8_t volatile*)(BITBAND_REGADDR(Reg,Bit))))

/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
typedef enum {
  INT_Initial_Stack_Pointer    = 0,                /**< Initial Stack Pointer */
  INT_Initial_Program_Counter  = 1,                /**< Initial Program Counter */
  INT_NMI                      = 2,                /**< Non-maskable Interrupt (NMI) */
  INT_Hard_Fault               = 3,                /**< Hard Fault */
  INT_Mem_Manage_Fault         = 4,                /**< MemManage Fault */
  INT_Bus_Fault                = 5,                /**< Bus Fault */
  INT_Usage_Fault              = 6,                /**< Usage Fault */
  INT_Reserved7                = 7,                /**< Reserved interrupt */
  INT_Reserved8                = 8,                /**< Reserved interrupt */
  INT_Reserved9                = 9,                /**< Reserved interrupt */
  INT_Reserved10               = 10,               /**< Reserved interrupt */
  INT_SVCall                   = 11,               /**< Supervisor call (SVCall) */
  INT_DebugMonitor             = 12,               /**< Debug Monitor */
  INT_Reserved13               = 13,               /**< Reserved interrupt */
  INT_PendableSrvReq           = 14,               /**< Pendable request for system service (PendableSrvReq) */
  INT_SysTick                  = 15,               /**< System tick timer (SysTick) */
  INT_DMA0                     = 16,               /**< DMA channel 0, 16 transfer complete */
  INT_DMA1                     = 17,               /**< DMA channel 1, 17 transfer complete */
  INT_DMA2                     = 18,               /**< DMA channel 2, 18 transfer complete */
  INT_DMA3                     = 19,               /**< DMA channel 3, 19 transfer complete */
  INT_DMA4                     = 20,               /**< DMA channel 4, 20 transfer complete */
  INT_DMA5                     = 21,               /**< DMA channel 5, 21 transfer complete */
  INT_DMA6                     = 22,               /**< DMA channel 6, 22 transfer complete */
  INT_DMA7                     = 23,               /**< DMA channel 7, 23 transfer complete */
  INT_DMA8                     = 24,               /**< DMA channel 8, 24 transfer complete */
  INT_DMA9                     = 25,               /**< DMA channel 9, 25 transfer complete */
  INT_DMA10                    = 26,               /**< DMA channel 10, 26 transfer complete */
  INT_DMA11                    = 27,               /**< DMA channel 11, 27 transfer complete */
  INT_DMA12                    = 28,               /**< DMA channel 12, 28 transfer complete */
  INT_DMA13                    = 29,               /**< DMA channel 13, 29 transfer complete */
  INT_DMA14                    = 30,               /**< DMA channel 14, 30 transfer complete */
  INT_DMA15                    = 31,               /**< DMA channel 15, 31 transfer complete */
  INT_DMA_Error                = 32,               /**< DMA error interrupt channels 0-1531 */
  INT_MCM                      = 33,               /**< MCM interrupt */
  INT_FTFL                     = 34,               /**< Command complete */
  INT_FTFL_Collision           = 35,               /**< Read collision */
  INT_PMC                      = 36,               /**< Low-voltage detect, low-voltage warning */
  INT_LLWU                     = 37,               /**< Low Leakage Wakeup */
  INT_WDOG_EWM                 = 38,               /**< Both watchdog modules share this interrupt */
  INT_Reserved39               = 39,               /**< Reserved interrupt */
  INT_Reserved40               = 40,               /**< Reserved interrupt */
  INT_Reserved41               = 41,               /**< Reserved interrupt */
  INT_Reserved42               = 42,               /**< Reserved interrupt */
  INT_Reserved43               = 43,               /**< Reserved interrupt */
  INT_Reserved44               = 44,               /**< Reserved interrupt */
  INT_Reserved45               = 45,               /**< Reserved interrupt */
  INT_Reserved46               = 46,               /**< Reserved interrupt */
  INT_UART0_RX_TX              = 47,               /**< UART0 status sources */
  INT_UART0_ERR                = 48,               /**< UART0 error sources */
  INT_UART1_RX_TX              = 49,               /**< UART1 status sources */
  INT_UART1_ERR                = 50,               /**< UART1 error sources */
  INT_Reserved51               = 51,               /**< Reserved interrupt */
  INT_Reserved52               = 52,               /**< Reserved interrupt */
  INT_Reserved53               = 53,               /**< Reserved interrupt */
  INT_ADC_ERR                  = 54,               /**< ADC_ERR A and B ( zero cross, high/low limit) */
  INT_ADCA                     = 55,               /**< ADCA Scan complete */
  INT_CMP0                     = 56,               /**< CMP0 */
  INT_CMP1                     = 57,               /**< CMP1 */
  INT_FTM0                     = 58,               /**< FTM0 8 channels */
  INT_FTM1                     = 59,               /**< FTM1 2 channels */
  INT_Reserved60               = 60,               /**< Reserved interrupt */
  INT_Reserved61               = 61,               /**< Reserved interrupt */
  INT_Reserved62               = 62,               /**< Reserved interrupt */
  INT_Reserved63               = 63,               /**< Reserved interrupt */
  INT_PIT0                     = 64,               /**< PIT Channel 0 */
  INT_PIT1                     = 65,               /**< PIT Channel 1 */
  INT_PIT2                     = 66,               /**< PIT Channel 2 */
  INT_PIT3                     = 67,               /**< PIT Channel 3 */
  INT_PDB0                     = 68,               /**< PDB0 */
  INT_Reserved69               = 69,               /**< Reserved interrupt */
  INT_XBARA                    = 70,               /**< XBARA */
  INT_PDB1                     = 71,               /**< PDB1 */
  INT_Reserved72               = 72,               /**< Reserved interrupt */
  INT_MCG                      = 73,               /**< MCG */
  INT_Reserved74               = 74,               /**< Reserved interrupt */
  INT_PORTA                    = 75,               /**< Pin detect (Port A) */
  INT_PORTB                    = 76,               /**< Pin detect (Port B) */
  INT_PORTC                    = 77,               /**< Pin detect (Port C) */
  INT_PORTD                    = 78,               /**< Pin detect (Port D) */
  INT_PORTE                    = 79,               /**< Pin detect (Port E) */
  INT_SWI                      = 80,               /**< Software */
  INT_Reserved81               = 81,               /**< Reserved interrupt */
  INT_ENC_COMPARE              = 82,               /**< ENC Compare */
  INT_ENC_HOME_DOG             = 83,               /**< ENC Home */
  INT_ENC_WDOG                 = 84,               /**< ENC Watchdog/Simultaneous A and B change */
  INT_ENC_INDEX                = 85,               /**< ENC Index/Roll over/Roll Under */
  INT_CMP2                     = 86,               /**< CMP2 */
  INT_FTM3                     = 87,               /**< FTM3 8 channels */
  INT_Reserved88               = 88,               /**< Reserved interrupt */
  INT_ADCB                     = 89,               /**< ADCB Scan complete */
  INT_Reserved90               = 90,               /**< Reserved interrupt */
  INT_CAN0_ORed_Message_buffer = 91,               /**< FLexCAN0 OR'ed Message buffer (0-15) */
  INT_CAN0_Bus_Off             = 92,               /**< FLexCAN0 Bus Off */
  INT_CAN0_Error               = 93,               /**< FLexCAN0 Error */
  INT_CAN0_Tx_Warning          = 94,               /**< FLexCAN0 Transmit Warning */
  INT_CAN0_Rx_Warning          = 95,               /**< FLexCAN0 Receive Warning */
  INT_CAN0_Wake_Up             = 96,               /**< FLexCAN0 Wake Up */
  INT_PWMA_CMP0                = 97,               /**< eFlexPWM submodule 0 Compare */
  INT_PWMA_RELOAD0             = 98,               /**< eFlexPWM submodule 0 Reload */
  INT_PWMA_CMP1                = 99,               /**< eFlexPWM submodule 1 Compare */
  INT_PWMA_RELOAD1             = 100,              /**< eFlexPWM submodule 1 Reload */
  INT_PWMA_CMP2                = 101,              /**< eFlexPWM submodule 2 Compare */
  INT_PWMA_RELOAD2             = 102,              /**< eFlexPWM submodule 2 Reload */
  INT_PWMA_CMP3                = 103,              /**< eFlexPWM submodule 3 Compare */
  INT_PWMA_RELOAD3             = 104,              /**< eFlexPWM submodule 3 Reload */
  INT_PWMA_CAP                 = 105,              /**< eFlexPWM all input captures */
  INT_PWMA_RERR                = 106,              /**< eFlexPWM reload error */
  INT_PWMA_FAULT               = 107,              /**< eFlexPWM Fault */
  INT_CMP3                     = 108,              /**< CMP3 */
  INT_Reserved109              = 109,              /**< Reserved interrupt */
  INT_CAN1_ORed_Message_buffer = 110,              /**< FLexCAN1 OR'ed Message buffer (0-15) */
  INT_CAN1_Bus_Off             = 111,              /**< FLexCAN1 Bus Off */
  INT_CAN1_Error               = 112,              /**< FLexCAN1 Error */
  INT_CAN1_Tx_Warning          = 113,              /**< FLexCAN1 Transmit Warning */
  INT_CAN1_Rx_Warning          = 114,              /**< FLexCAN1 Receive Warning */
  INT_CAN1_Wake_Up             = 115               /**< FLexCAN1 Wake Up */
} IRQInterruptIndex;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


/* ----------------------------------------------------------------------------
   -- Peripheral type defines
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_defines Peripheral type defines
 * @{
 */


