Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
#define ADC_GC2_GAIN14_MASK                      0x3000u
#define ADC_GC2_GAIN14_SHIFT                     12
#define ADC_GC2_GAIN14(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN14_SHIFT))&ADC_GC2_GAIN14_MASK)
#define ADC_GC2_GAIN15_MASK                      0xC000u
#define ADC_GC2_GAIN15_SHIFT                     14
#define ADC_GC2_GAIN15(x)                        (((uint16_t)(((uint16_t)(x))<<ADC_GC2_GAIN15_SHIFT))&ADC_GC2_GAIN15_MASK)
/* SCTRL Bit Fields */
#define ADC_SCTRL_SC_MASK                        0xFFFFu
#define ADC_SCTRL_SC_SHIFT                       0
#define ADC_SCTRL_SC(x)                          (((uint16_t)(((uint16_t)(x))<<ADC_SCTRL_SC_SHIFT))&ADC_SCTRL_SC_MASK)
/* PWR2 Bit Fields */
#define ADC_PWR2_SPEEDA_MASK                     0x3u
#define ADC_PWR2_SPEEDA_SHIFT                    0
#define ADC_PWR2_SPEEDA(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_SPEEDA_SHIFT))&ADC_PWR2_SPEEDA_MASK)
#define ADC_PWR2_SPEEDB_MASK                     0xCu
#define ADC_PWR2_SPEEDB_SHIFT                    2
#define ADC_PWR2_SPEEDB(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_SPEEDB_SHIFT))&ADC_PWR2_SPEEDB_MASK)
#define ADC_PWR2_DIV1_MASK                       0x3F00u
#define ADC_PWR2_DIV1_SHIFT                      8
#define ADC_PWR2_DIV1(x)                         (((uint16_t)(((uint16_t)(x))<<ADC_PWR2_DIV1_SHIFT))&ADC_PWR2_DIV1_MASK)
/* CTRL3 Bit Fields */
#define ADC_CTRL3_SCNT0_MASK                     0x7u
#define ADC_CTRL3_SCNT0_SHIFT                    0
#define ADC_CTRL3_SCNT0(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT0_SHIFT))&ADC_CTRL3_SCNT0_MASK)
#define ADC_CTRL3_SCNT1_MASK                     0x38u
#define ADC_CTRL3_SCNT1_SHIFT                    3
#define ADC_CTRL3_SCNT1(x)                       (((uint16_t)(((uint16_t)(x))<<ADC_CTRL3_SCNT1_SHIFT))&ADC_CTRL3_SCNT1_MASK)
#define ADC_CTRL3_DMASRC_MASK                    0x40u
#define ADC_CTRL3_DMASRC_SHIFT                   6
/* SCHLTEN Bit Fields */
#define ADC_SCHLTEN_SCHLTEN_MASK                 0xFFFFu
#define ADC_SCHLTEN_SCHLTEN_SHIFT                0
#define ADC_SCHLTEN_SCHLTEN(x)                   (((uint16_t)(((uint16_t)(x))<<ADC_SCHLTEN_SCHLTEN_SHIFT))&ADC_SCHLTEN_SCHLTEN_MASK)

/*!
 * @}
 */ /* end of group ADC_Register_Masks */


/* ADC - Peripheral instance base addresses */
/** Peripheral ADC base pointer */
#define ADC_BASE_PTR                             ((ADC_MemMapPtr)0x4005C000u)
/** Array initializer of ADC peripheral base pointers */
#define ADC_BASE_PTRS                            { ADC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- ADC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ADC_Register_Accessor_Macros ADC - Register accessor macros
 * @{
 */


/* ADC - Register instance definitions */
/* ADC */
#define ADC_CTRL1                                ADC_CTRL1_REG(ADC_BASE_PTR)
#define ADC_CTRL2                                ADC_CTRL2_REG(ADC_BASE_PTR)
#define ADC_ZXCTRL1                              ADC_ZXCTRL1_REG(ADC_BASE_PTR)
#define ADC_ZXCTRL2                              ADC_ZXCTRL2_REG(ADC_BASE_PTR)
#define ADC_CLIST1                               ADC_CLIST1_REG(ADC_BASE_PTR)
#define ADC_CLIST2                               ADC_CLIST2_REG(ADC_BASE_PTR)
#define ADC_CLIST3                               ADC_CLIST3_REG(ADC_BASE_PTR)
#define ADC_CLIST4                               ADC_CLIST4_REG(ADC_BASE_PTR)
#define ADC_SDIS                                 ADC_SDIS_REG(ADC_BASE_PTR)
#define ADC_STAT                                 ADC_STAT_REG(ADC_BASE_PTR)
#define ADC_RDY                                  ADC_RDY_REG(ADC_BASE_PTR)
#define ADC_LOLIMSTAT                            ADC_LOLIMSTAT_REG(ADC_BASE_PTR)
#define ADC_HILIMSTAT                            ADC_HILIMSTAT_REG(ADC_BASE_PTR)
#define ADC_ZXSTAT                               ADC_ZXSTAT_REG(ADC_BASE_PTR)
#define ADC_RSLT0                                ADC_RSLT_REG(ADC_BASE_PTR,0)
#define ADC_RSLT1                                ADC_RSLT_REG(ADC_BASE_PTR,1)
#define ADC_RSLT2                                ADC_RSLT_REG(ADC_BASE_PTR,2)
#define ADC_RSLT3                                ADC_RSLT_REG(ADC_BASE_PTR,3)
#define ADC_RSLT4                                ADC_RSLT_REG(ADC_BASE_PTR,4)
#define ADC_RSLT5                                ADC_RSLT_REG(ADC_BASE_PTR,5)
#define ADC_RSLT6                                ADC_RSLT_REG(ADC_BASE_PTR,6)
#define ADC_RSLT7                                ADC_RSLT_REG(ADC_BASE_PTR,7)
#define ADC_RSLT8                                ADC_RSLT_REG(ADC_BASE_PTR,8)
#define ADC_RSLT9                                ADC_RSLT_REG(ADC_BASE_PTR,9)
#define ADC_RSLT10                               ADC_RSLT_REG(ADC_BASE_PTR,10)
#define ADC_RSLT11                               ADC_RSLT_REG(ADC_BASE_PTR,11)
#define ADC_RSLT12                               ADC_RSLT_REG(ADC_BASE_PTR,12)
#define ADC_RSLT13                               ADC_RSLT_REG(ADC_BASE_PTR,13)
#define ADC_RSLT14                               ADC_RSLT_REG(ADC_BASE_PTR,14)
#define ADC_RSLT15                               ADC_RSLT_REG(ADC_BASE_PTR,15)
#define ADC_LOLIM0                               ADC_LOLIM_REG(ADC_BASE_PTR,0)
#define ADC_LOLIM1                               ADC_LOLIM_REG(ADC_BASE_PTR,1)
#define ADC_LOLIM2                               ADC_LOLIM_REG(ADC_BASE_PTR,2)
#define ADC_LOLIM3                               ADC_LOLIM_REG(ADC_BASE_PTR,3)
#define ADC_LOLIM4                               ADC_LOLIM_REG(ADC_BASE_PTR,4)
#define ADC_LOLIM5                               ADC_LOLIM_REG(ADC_BASE_PTR,5)
#define ADC_LOLIM6                               ADC_LOLIM_REG(ADC_BASE_PTR,6)
#define ADC_LOLIM7                               ADC_LOLIM_REG(ADC_BASE_PTR,7)
#define ADC_LOLIM8                               ADC_LOLIM_REG(ADC_BASE_PTR,8)
#define ADC_LOLIM9                               ADC_LOLIM_REG(ADC_BASE_PTR,9)
#define ADC_LOLIM10                              ADC_LOLIM_REG(ADC_BASE_PTR,10)
#define ADC_LOLIM11                              ADC_LOLIM_REG(ADC_BASE_PTR,11)
#define ADC_LOLIM12                              ADC_LOLIM_REG(ADC_BASE_PTR,12)
#define ADC_LOLIM13                              ADC_LOLIM_REG(ADC_BASE_PTR,13)
#define ADC_LOLIM14                              ADC_LOLIM_REG(ADC_BASE_PTR,14)
#define ADC_LOLIM15                              ADC_LOLIM_REG(ADC_BASE_PTR,15)
#define ADC_HILIM0                               ADC_HILIM_REG(ADC_BASE_PTR,0)
#define ADC_HILIM1                               ADC_HILIM_REG(ADC_BASE_PTR,1)
#define ADC_HILIM2                               ADC_HILIM_REG(ADC_BASE_PTR,2)
#define ADC_HILIM3                               ADC_HILIM_REG(ADC_BASE_PTR,3)
#define ADC_HILIM4                               ADC_HILIM_REG(ADC_BASE_PTR,4)
#define ADC_HILIM5                               ADC_HILIM_REG(ADC_BASE_PTR,5)
#define ADC_HILIM6                               ADC_HILIM_REG(ADC_BASE_PTR,6)
#define ADC_HILIM7                               ADC_HILIM_REG(ADC_BASE_PTR,7)
#define ADC_HILIM8                               ADC_HILIM_REG(ADC_BASE_PTR,8)
#define ADC_HILIM9                               ADC_HILIM_REG(ADC_BASE_PTR,9)
#define ADC_HILIM10                              ADC_HILIM_REG(ADC_BASE_PTR,10)
#define ADC_HILIM11                              ADC_HILIM_REG(ADC_BASE_PTR,11)
#define ADC_HILIM12                              ADC_HILIM_REG(ADC_BASE_PTR,12)
#define ADC_HILIM13                              ADC_HILIM_REG(ADC_BASE_PTR,13)
#define ADC_HILIM14                              ADC_HILIM_REG(ADC_BASE_PTR,14)
#define ADC_HILIM15                              ADC_HILIM_REG(ADC_BASE_PTR,15)
#define ADC_OFFST0                               ADC_OFFST_REG(ADC_BASE_PTR,0)
#define ADC_OFFST1                               ADC_OFFST_REG(ADC_BASE_PTR,1)
#define ADC_OFFST2                               ADC_OFFST_REG(ADC_BASE_PTR,2)
#define ADC_OFFST3                               ADC_OFFST_REG(ADC_BASE_PTR,3)
#define ADC_OFFST4                               ADC_OFFST_REG(ADC_BASE_PTR,4)
#define ADC_OFFST5                               ADC_OFFST_REG(ADC_BASE_PTR,5)
#define ADC_OFFST6                               ADC_OFFST_REG(ADC_BASE_PTR,6)
#define ADC_OFFST7                               ADC_OFFST_REG(ADC_BASE_PTR,7)
#define ADC_OFFST8                               ADC_OFFST_REG(ADC_BASE_PTR,8)
#define ADC_OFFST9                               ADC_OFFST_REG(ADC_BASE_PTR,9)
#define ADC_OFFST10                              ADC_OFFST_REG(ADC_BASE_PTR,10)
#define ADC_OFFST11                              ADC_OFFST_REG(ADC_BASE_PTR,11)
#define ADC_OFFST12                              ADC_OFFST_REG(ADC_BASE_PTR,12)
#define ADC_OFFST13                              ADC_OFFST_REG(ADC_BASE_PTR,13)
#define ADC_OFFST14                              ADC_OFFST_REG(ADC_BASE_PTR,14)
#define ADC_OFFST15                              ADC_OFFST_REG(ADC_BASE_PTR,15)
#define ADC_PWR                                  ADC_PWR_REG(ADC_BASE_PTR)
#define ADC_CAL                                  ADC_CAL_REG(ADC_BASE_PTR)
#define ADC_GC1                                  ADC_GC1_REG(ADC_BASE_PTR)
#define ADC_GC2                                  ADC_GC2_REG(ADC_BASE_PTR)
#define ADC_SCTRL                                ADC_SCTRL_REG(ADC_BASE_PTR)
#define ADC_PWR2                                 ADC_PWR2_REG(ADC_BASE_PTR)
#define ADC_CTRL3                                ADC_CTRL3_REG(ADC_BASE_PTR)
#define ADC_SCHLTEN                              ADC_SCHLTEN_REG(ADC_BASE_PTR)

/* ADC - Register array accessors */
#define ADC_RSLT(index)                          ADC_RSLT_REG(ADC_BASE_PTR,index)
#define ADC_LOLIM(index)                         ADC_LOLIM_REG(ADC_BASE_PTR,index)
#define ADC_HILIM(index)                         ADC_HILIM_REG(ADC_BASE_PTR,index)
#define ADC_OFFST(index)                         ADC_OFFST_REG(ADC_BASE_PTR,index)

/*!
 * @}
 */ /* end of group ADC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group ADC_Peripheral */


/* ----------------------------------------------------------------------------
   -- AOI
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AOI_Peripheral AOI
 * @{
 */

/** AOI - Peripheral register structure */
typedef struct AOI_MemMap {
  struct {                                         /* offset: 0x0, array step: 0x4 */
    uint16_t BFCRT01;                                /**< Boolean Function Term 0 and 1 Configuration Register for EVENTn, array offset: 0x0, array step: 0x4 */
    uint16_t BFCRT23;                                /**< Boolean Function Term 2 and 3 Configuration Register for EVENTn, array offset: 0x2, array step: 0x4 */
  } BFCRT[4];
} volatile *AOI_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- AOI - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AOI_Register_Accessor_Macros AOI - Register accessor macros
 * @{
 */


