Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
/* PFAPR Bit Fields */
#define FMC_PFAPR_M0AP_MASK                      0x3u
#define FMC_PFAPR_M0AP_SHIFT                     0
#define FMC_PFAPR_M0AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M0AP_SHIFT))&FMC_PFAPR_M0AP_MASK)
#define FMC_PFAPR_M1AP_MASK                      0xCu
#define FMC_PFAPR_M1AP_SHIFT                     2
#define FMC_PFAPR_M1AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M1AP_SHIFT))&FMC_PFAPR_M1AP_MASK)
#define FMC_PFAPR_M2AP_MASK                      0x30u
#define FMC_PFAPR_M2AP_SHIFT                     4
#define FMC_PFAPR_M2AP(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFAPR_M2AP_SHIFT))&FMC_PFAPR_M2AP_MASK)
#define FMC_PFAPR_M0PFD_MASK                     0x10000u
#define FMC_PFAPR_M0PFD_SHIFT                    16
#define FMC_PFAPR_M1PFD_MASK                     0x20000u
#define FMC_PFAPR_M1PFD_SHIFT                    17
#define FMC_PFAPR_M2PFD_MASK                     0x40000u
#define FMC_PFAPR_M2PFD_SHIFT                    18
/* PFB0CR Bit Fields */
#define FMC_PFB0CR_B0SEBE_MASK                   0x1u
#define FMC_PFB0CR_B0SEBE_SHIFT                  0
#define FMC_PFB0CR_B0IPE_MASK                    0x2u
#define FMC_PFB0CR_B0IPE_SHIFT                   1
#define FMC_PFB0CR_B0DPE_MASK                    0x4u
#define FMC_PFB0CR_B0DPE_SHIFT                   2
#define FMC_PFB0CR_B0ICE_MASK                    0x8u
#define FMC_PFB0CR_B0ICE_SHIFT                   3
#define FMC_PFB0CR_B0DCE_MASK                    0x10u
#define FMC_PFB0CR_B0DCE_SHIFT                   4
#define FMC_PFB0CR_CRC_MASK                      0xE0u
#define FMC_PFB0CR_CRC_SHIFT                     5
#define FMC_PFB0CR_CRC(x)                        (((uint32_t)(((uint32_t)(x))<<FMC_PFB0CR_CRC_SHIFT))&FMC_PFB0CR_CRC_MASK)
#define FMC_PFB0CR_B0MW_MASK                     0x60000u
#define FMC_PFB0CR_B0MW_SHIFT                    17
#define FMC_PFB0CR_B0MW(x)                       (((uint32_t)(((uint32_t)(x))<<FMC_PFB0CR_B0MW_SHIFT))&FMC_PFB0CR_B0MW_MASK)
#define FMC_PFB0CR_S_B_INV_MASK                  0x80000u
#define FMC_PFB0CR_S_B_INV_SHIFT                 19
#define FMC_PFB0CR_CINV_WAY_MASK                 0xF00000u
#define FMC_PFB0CR_CINV_WAY_SHIFT                20
#define FMC_PFB0CR_CINV_WAY(x)                   (((uint32_t)(((uint32_t)(x))<<FMC_PFB0CR_CINV_WAY_SHIFT))&FMC_PFB0CR_CINV_WAY_MASK)
#define FMC_PFB0CR_CLCK_WAY_MASK                 0xF000000u
#define FMC_PFB0CR_CLCK_WAY_SHIFT                24
#define FMC_PFB0CR_CLCK_WAY(x)                   (((uint32_t)(((uint32_t)(x))<<FMC_PFB0CR_CLCK_WAY_SHIFT))&FMC_PFB0CR_CLCK_WAY_MASK)
#define FMC_PFB0CR_B0RWSC_MASK                   0xF0000000u
#define FMC_PFB0CR_B0RWSC_SHIFT                  28
#define FMC_PFB0CR_B0RWSC(x)                     (((uint32_t)(((uint32_t)(x))<<FMC_PFB0CR_B0RWSC_SHIFT))&FMC_PFB0CR_B0RWSC_MASK)
/* TAGVD Bit Fields */
#define FMC_TAGVD_valid_MASK                     0x1u
#define FMC_TAGVD_valid_SHIFT                    0
#define FMC_TAGVD_cache_tag_MASK                 0xFFFE0u
#define FMC_TAGVD_cache_tag_SHIFT                5
#define FMC_TAGVD_cache_tag(x)                   (((uint32_t)(((uint32_t)(x))<<FMC_TAGVD_cache_tag_SHIFT))&FMC_TAGVD_cache_tag_MASK)
/* DATA_UM Bit Fields */
#define FMC_DATA_UM_data_MASK                    0xFFFFFFFFu
#define FMC_DATA_UM_data_SHIFT                   0
#define FMC_DATA_UM_data(x)                      (((uint32_t)(((uint32_t)(x))<<FMC_DATA_UM_data_SHIFT))&FMC_DATA_UM_data_MASK)
/* DATA_MU Bit Fields */
#define FMC_DATA_MU_data_MASK                    0xFFFFFFFFu
#define FMC_DATA_MU_data_SHIFT                   0
#define FMC_DATA_MU_data(x)                      (((uint32_t)(((uint32_t)(x))<<FMC_DATA_MU_data_SHIFT))&FMC_DATA_MU_data_MASK)
/* DATA_ML Bit Fields */
#define FMC_DATA_ML_data_MASK                    0xFFFFFFFFu
#define FMC_DATA_ML_data_SHIFT                   0
#define FMC_DATA_ML_data(x)                      (((uint32_t)(((uint32_t)(x))<<FMC_DATA_ML_data_SHIFT))&FMC_DATA_ML_data_MASK)
/* DATA_LM Bit Fields */
#define FMC_DATA_LM_data_MASK                    0xFFFFFFFFu
#define FMC_DATA_LM_data_SHIFT                   0
#define FMC_DATA_LM_data(x)                      (((uint32_t)(((uint32_t)(x))<<FMC_DATA_LM_data_SHIFT))&FMC_DATA_LM_data_MASK)

/*!
 * @}
 */ /* end of group FMC_Register_Masks */


/* FMC - Peripheral instance base addresses */
/** Peripheral FMC base pointer */
#define FMC_BASE_PTR                             ((FMC_MemMapPtr)0x4001F000u)
/** Array initializer of FMC peripheral base pointers */
#define FMC_BASE_PTRS                            { FMC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- FMC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FMC_Register_Accessor_Macros FMC - Register accessor macros
 * @{
 */


/* FMC - Register instance definitions */
/* FMC */
#define FMC_PFAPR                                FMC_PFAPR_REG(FMC_BASE_PTR)
#define FMC_PFB0CR                               FMC_PFB0CR_REG(FMC_BASE_PTR)
#define FMC_PFB1CR                               FMC_PFB1CR_REG(FMC_BASE_PTR)
#define FMC_TAGVDW0S0                            FMC_TAGVD_REG(FMC_BASE_PTR,0,0)
#define FMC_TAGVDW0S1                            FMC_TAGVD_REG(FMC_BASE_PTR,0,1)
#define FMC_TAGVDW1S0                            FMC_TAGVD_REG(FMC_BASE_PTR,1,0)
#define FMC_TAGVDW1S1                            FMC_TAGVD_REG(FMC_BASE_PTR,1,1)
#define FMC_TAGVDW2S0                            FMC_TAGVD_REG(FMC_BASE_PTR,2,0)
#define FMC_TAGVDW2S1                            FMC_TAGVD_REG(FMC_BASE_PTR,2,1)
#define FMC_TAGVDW3S0                            FMC_TAGVD_REG(FMC_BASE_PTR,3,0)
#define FMC_TAGVDW3S1                            FMC_TAGVD_REG(FMC_BASE_PTR,3,1)
#define FMC_DATAW0S0UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,0,0)
#define FMC_DATAW0S0MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,0,0)
#define FMC_DATAW0S0ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,0,0)
#define FMC_DATAW0S0LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,0,0)
#define FMC_DATAW0S1UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,0,1)
#define FMC_DATAW0S1MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,0,1)
#define FMC_DATAW0S1ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,0,1)
#define FMC_DATAW0S1LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,0,1)
#define FMC_DATAW1S0UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,1,0)
#define FMC_DATAW1S0MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,1,0)
#define FMC_DATAW1S0ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,1,0)
#define FMC_DATAW1S0LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,1,0)
#define FMC_DATAW1S1UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,1,1)
#define FMC_DATAW1S1MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,1,1)
#define FMC_DATAW1S1ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,1,1)
#define FMC_DATAW1S1LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,1,1)
#define FMC_DATAW2S0UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,2,0)
#define FMC_DATAW2S0MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,2,0)
#define FMC_DATAW2S0ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,2,0)
#define FMC_DATAW2S0LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,2,0)
#define FMC_DATAW2S1UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,2,1)
#define FMC_DATAW2S1MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,2,1)
#define FMC_DATAW2S1ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,2,1)
#define FMC_DATAW2S1LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,2,1)
#define FMC_DATAW3S0UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,3,0)
#define FMC_DATAW3S0MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,3,0)
#define FMC_DATAW3S0ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,3,0)
#define FMC_DATAW3S0LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,3,0)
#define FMC_DATAW3S1UM                           FMC_DATA_UM_REG(FMC_BASE_PTR,3,1)
#define FMC_DATAW3S1MU                           FMC_DATA_MU_REG(FMC_BASE_PTR,3,1)
#define FMC_DATAW3S1ML                           FMC_DATA_ML_REG(FMC_BASE_PTR,3,1)
#define FMC_DATAW3S1LM                           FMC_DATA_LM_REG(FMC_BASE_PTR,3,1)

