Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
/* PORT - Register array accessors */
#define PORTA_PCR(index)                         PORT_PCR_REG(PORTA_BASE_PTR,index)
#define PORTB_PCR(index)                         PORT_PCR_REG(PORTB_BASE_PTR,index)
#define PORTC_PCR(index)                         PORT_PCR_REG(PORTC_BASE_PTR,index)
#define PORTD_PCR(index)                         PORT_PCR_REG(PORTD_BASE_PTR,index)
#define PORTE_PCR(index)                         PORT_PCR_REG(PORTE_BASE_PTR,index)

/*!
 * @}
 */ /* end of group PORT_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group PORT_Peripheral */


/* ----------------------------------------------------------------------------
   -- PWMA
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWMA_Peripheral PWMA
 * @{
 */

/** PWMA - Peripheral register structure */
typedef struct PWMA_MemMap {
  struct {                                         /* offset: 0x0, array step: 0x58 */
    uint16_t CNT;                                    /**< Counter Register, array offset: 0x0, array step: 0x58 */
    uint16_t INIT;                                   /**< Initial Count Register, array offset: 0x2, array step: 0x58 */
    uint16_t CTRL2;                                  /**< Control 2 Register, array offset: 0x4, array step: 0x58 */
    uint16_t CTRL;                                   /**< Control Register, array offset: 0x6, array step: 0x58 */
    uint8_t RESERVED_0[2];
    uint16_t VAL0;                                   /**< Value Register 0, array offset: 0xA, array step: 0x58 */
    uint16_t FRACVAL1;                               /**< Fractional Value Register 1, array offset: 0xC, array step: 0x58 */
    uint16_t VAL1;                                   /**< Value Register 1, array offset: 0xE, array step: 0x58 */
    uint16_t FRACVAL2;                               /**< Fractional Value Register 2, array offset: 0x10, array step: 0x58 */
    uint16_t VAL2;                                   /**< Value Register 2, array offset: 0x12, array step: 0x58 */
    uint16_t FRACVAL3;                               /**< Fractional Value Register 3, array offset: 0x14, array step: 0x58 */
    uint16_t VAL3;                                   /**< Value Register 3, array offset: 0x16, array step: 0x58 */
    uint16_t FRACVAL4;                               /**< Fractional Value Register 4, array offset: 0x18, array step: 0x58 */
    uint16_t VAL4;                                   /**< Value Register 4, array offset: 0x1A, array step: 0x58 */
    uint16_t FRACVAL5;                               /**< Fractional Value Register 5, array offset: 0x1C, array step: 0x58 */
    uint16_t VAL5;                                   /**< Value Register 5, array offset: 0x1E, array step: 0x58 */
    uint16_t FRCTRL;                                 /**< Fractional Control Register, array offset: 0x20, array step: 0x58 */
    uint16_t OCTRL;                                  /**< Output Control Register, array offset: 0x22, array step: 0x58 */
    uint16_t STS;                                    /**< Status Register, array offset: 0x24, array step: 0x58 */
    uint16_t INTEN;                                  /**< Interrupt Enable Register, array offset: 0x26, array step: 0x58 */
    uint16_t DMAEN;                                  /**< DMA Enable Register, array offset: 0x28, array step: 0x58 */
    uint16_t TCTRL;                                  /**< Output Trigger Control Register, array offset: 0x2A, array step: 0x58 */
    uint16_t DISMAP[1];                              /**< Fault Disable Mapping Register 0..Fault Disable Mapping Register 1, array offset: 0x2C, array step: index*0x58, index2*0x2 */
   uint16_t RESERVED_1[1];
    uint16_t DTCNT0;                                 /**< Deadtime Count Register 0, array offset: 0x30, array step: 0x58 */
    uint16_t DTCNT1;                                 /**< Deadtime Count Register 1, array offset: 0x32, array step: 0x58 */
    uint16_t CAPTCTRLA;                              /**< Capture Control A Register, array offset: 0x34, array step: 0x58 */
    uint16_t CAPTCOMPA;                              /**< Capture Compare A Register, array offset: 0x36, array step: 0x58 */
    uint16_t CAPTCTRLB;                              /**< Capture Control B Register, array offset: 0x38, array step: 0x58 */
    uint16_t CAPTCOMPB;                              /**< Capture Compare B Register, array offset: 0x3A, array step: 0x58 */
    uint16_t CAPTCTRLX;                              /**< Capture Control X Register, array offset: 0x3C, array step: 0x58 */
    uint16_t CAPTCOMPX;                              /**< Capture Compare X Register, array offset: 0x3E, array step: 0x58 */
    uint16_t CVAL0;                                  /**< Capture Value 0 Register, array offset: 0x40, array step: 0x58 */
    uint16_t CVAL0CYC;                               /**< Capture Value 0 Cycle Register, array offset: 0x42, array step: 0x58 */
    uint16_t CVAL1;                                  /**< Capture Value 1 Register, array offset: 0x44, array step: 0x58 */
    uint16_t CVAL1CYC;                               /**< Capture Value 1 Cycle Register, array offset: 0x46, array step: 0x58 */
    uint16_t CVAL2;                                  /**< Capture Value 2 Register, array offset: 0x48, array step: 0x58 */
    uint16_t CVAL2CYC;                               /**< Capture Value 2 Cycle Register, array offset: 0x4A, array step: 0x58 */
    uint16_t CVAL3;                                  /**< Capture Value 3 Register, array offset: 0x4C, array step: 0x58 */
    uint16_t CVAL3CYC;                               /**< Capture Value 3 Cycle Register, array offset: 0x4E, array step: 0x58 */
    uint16_t CVAL4;                                  /**< Capture Value 4 Register, array offset: 0x50, array step: 0x58 */
    uint16_t CVAL4CYC;                               /**< Capture Value 4 Cycle Register, array offset: 0x52, array step: 0x58 */
    uint16_t CVAL5;                                  /**< Capture Value 5 Register, array offset: 0x54, array step: 0x58 */
    uint16_t CVAL5CYC;                               /**< Capture Value 5 Cycle Register, array offset: 0x56, array step: 0x58 */
    uint16_t RESERVED_2[4];
  } SM[4];
  uint16_t OUTEN;                                  /**< Output Enable Register, offset: 0x160 */
  uint16_t MASK;                                   /**< Mask Register, offset: 0x162 */
  uint16_t SWCOUT;                                 /**< Software Controlled Output Register, offset: 0x164 */
  uint16_t DTSRCSEL;                               /**< PWM Source Select Register, offset: 0x166 */
  uint16_t MCTRL;                                  /**< Master Control Register, offset: 0x168 */
  uint16_t MCTRL2;                                 /**< Master Control 2 Register, offset: 0x16A */
  struct {                                         /* offset: 0x16C, array step: 0xA */
    uint16_t FCTRL;                                  /**< Fault Control Register, array offset: 0x16C, array step: 0xA */
    uint16_t FSTS;                                   /**< Fault Status Register, array offset: 0x16E, array step: 0xA */
    uint16_t FFILT;                                  /**< Fault Filter Register, array offset: 0x170, array step: 0xA */
    uint16_t FTST;                                   /**< Fault Test Register, array offset: 0x172, array step: 0xA */
    uint16_t FCTRL2;                                 /**< Fault Control 2 Register, array offset: 0x174, array step: 0xA */
  } FAULT[1];
} volatile *PWMA_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- PWMA - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWMA_Register_Accessor_Macros PWMA - Register accessor macros
 * @{
 */


/* PWMA - Register accessors */
#define PWMA_CNT_REG(base,index)                 ((base)->SM[index].CNT)
#define PWMA_INIT_REG(base,index)                ((base)->SM[index].INIT)
#define PWMA_CTRL2_REG(base,index)               ((base)->SM[index].CTRL2)
#define PWMA_CTRL_REG(base,index)                ((base)->SM[index].CTRL)
#define PWMA_VAL0_REG(base,index)                ((base)->SM[index].VAL0)
#define PWMA_FRACVAL1_REG(base,index)            ((base)->SM[index].FRACVAL1)
#define PWMA_VAL1_REG(base,index)                ((base)->SM[index].VAL1)
#define PWMA_FRACVAL2_REG(base,index)            ((base)->SM[index].FRACVAL2)
#define PWMA_VAL2_REG(base,index)                ((base)->SM[index].VAL2)
#define PWMA_FRACVAL3_REG(base,index)            ((base)->SM[index].FRACVAL3)
#define PWMA_VAL3_REG(base,index)                ((base)->SM[index].VAL3)
#define PWMA_FRACVAL4_REG(base,index)            ((base)->SM[index].FRACVAL4)
#define PWMA_VAL4_REG(base,index)                ((base)->SM[index].VAL4)
#define PWMA_FRACVAL5_REG(base,index)            ((base)->SM[index].FRACVAL5)
#define PWMA_VAL5_REG(base,index)                ((base)->SM[index].VAL5)
#define PWMA_FRCTRL_REG(base,index)              ((base)->SM[index].FRCTRL)
#define PWMA_OCTRL_REG(base,index)               ((base)->SM[index].OCTRL)
#define PWMA_STS_REG(base,index)                 ((base)->SM[index].STS)
#define PWMA_INTEN_REG(base,index)               ((base)->SM[index].INTEN)
#define PWMA_DMAEN_REG(base,index)               ((base)->SM[index].DMAEN)
#define PWMA_TCTRL_REG(base,index)               ((base)->SM[index].TCTRL)
#define PWMA_DISMAP_REG(base,index,index2)       ((base)->SM[index].DISMAP[index2])
#define PWMA_DTCNT0_REG(base,index)              ((base)->SM[index].DTCNT0)
#define PWMA_DTCNT1_REG(base,index)              ((base)->SM[index].DTCNT1)
#define PWMA_CAPTCTRLA_REG(base,index)           ((base)->SM[index].CAPTCTRLA)
#define PWMA_CAPTCOMPA_REG(base,index)           ((base)->SM[index].CAPTCOMPA)
#define PWMA_CAPTCTRLB_REG(base,index)           ((base)->SM[index].CAPTCTRLB)
#define PWMA_CAPTCOMPB_REG(base,index)           ((base)->SM[index].CAPTCOMPB)
#define PWMA_CAPTCTRLX_REG(base,index)           ((base)->SM[index].CAPTCTRLX)
#define PWMA_CAPTCOMPX_REG(base,index)           ((base)->SM[index].CAPTCOMPX)
#define PWMA_CVAL0_REG(base,index)               ((base)->SM[index].CVAL0)
#define PWMA_CVAL0CYC_REG(base,index)            ((base)->SM[index].CVAL0CYC)
#define PWMA_CVAL1_REG(base,index)               ((base)->SM[index].CVAL1)
#define PWMA_CVAL1CYC_REG(base,index)            ((base)->SM[index].CVAL1CYC)
#define PWMA_CVAL2_REG(base,index)               ((base)->SM[index].CVAL2)
#define PWMA_CVAL2CYC_REG(base,index)            ((base)->SM[index].CVAL2CYC)
#define PWMA_CVAL3_REG(base,index)               ((base)->SM[index].CVAL3)
#define PWMA_CVAL3CYC_REG(base,index)            ((base)->SM[index].CVAL3CYC)
#define PWMA_CVAL4_REG(base,index)               ((base)->SM[index].CVAL4)
#define PWMA_CVAL4CYC_REG(base,index)            ((base)->SM[index].CVAL4CYC)
#define PWMA_CVAL5_REG(base,index)               ((base)->SM[index].CVAL5)
#define PWMA_CVAL5CYC_REG(base,index)            ((base)->SM[index].CVAL5CYC)
#define PWMA_OUTEN_REG(base)                     ((base)->OUTEN)
#define PWMA_MASK_REG(base)                      ((base)->MASK)
#define PWMA_SWCOUT_REG(base)                    ((base)->SWCOUT)
#define PWMA_DTSRCSEL_REG(base)                  ((base)->DTSRCSEL)
#define PWMA_MCTRL_REG(base)                     ((base)->MCTRL)
#define PWMA_MCTRL2_REG(base)                    ((base)->MCTRL2)
#define PWMA_FCTRL_REG(base,index)               ((base)->FAULT[index].FCTRL)
#define PWMA_FSTS_REG(base,index)                ((base)->FAULT[index].FSTS)
#define PWMA_FFILT_REG(base,index)               ((base)->FAULT[index].FFILT)
#define PWMA_FTST_REG(base,index)                ((base)->FAULT[index].FTST)
#define PWMA_FCTRL2_REG(base,index)              ((base)->FAULT[index].FCTRL2)

/*!
 * @}
 */ /* end of group PWMA_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- PWMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWMA_Register_Masks PWMA Register Masks
 * @{
 */

