Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
/* CNT Bit Fields */
#define PWMA_CNT_CNT_MASK                        0xFFFFu
#define PWMA_CNT_CNT_SHIFT                       0
#define PWMA_CNT_CNT(x)                          (((uint16_t)(((uint16_t)(x))<<PWMA_CNT_CNT_SHIFT))&PWMA_CNT_CNT_MASK)
/* INIT Bit Fields */
#define PWMA_INIT_INIT_MASK                      0xFFFFu
#define PWMA_INIT_INIT_SHIFT                     0
#define PWMA_INIT_INIT(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_INIT_INIT_SHIFT))&PWMA_INIT_INIT_MASK)
/* CTRL2 Bit Fields */
#define PWMA_CTRL2_CLK_SEL_MASK                  0x3u
#define PWMA_CTRL2_CLK_SEL_SHIFT                 0
#define PWMA_CTRL2_CLK_SEL(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_CTRL2_CLK_SEL_SHIFT))&PWMA_CTRL2_CLK_SEL_MASK)
#define PWMA_CTRL2_RELOAD_SEL_MASK               0x4u
#define PWMA_CTRL2_RELOAD_SEL_SHIFT              2
#define PWMA_CTRL2_FORCE_SEL_MASK                0x38u
#define PWMA_CTRL2_FORCE_SEL_SHIFT               3
#define PWMA_CTRL2_FORCE_SEL(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CTRL2_FORCE_SEL_SHIFT))&PWMA_CTRL2_FORCE_SEL_MASK)
#define PWMA_CTRL2_FORCE_MASK                    0x40u
#define PWMA_CTRL2_FORCE_SHIFT                   6
#define PWMA_CTRL2_FRCEN_MASK                    0x80u
#define PWMA_CTRL2_FRCEN_SHIFT                   7
#define PWMA_CTRL2_INIT_SEL_MASK                 0x300u
#define PWMA_CTRL2_INIT_SEL_SHIFT                8
#define PWMA_CTRL2_INIT_SEL(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_CTRL2_INIT_SEL_SHIFT))&PWMA_CTRL2_INIT_SEL_MASK)
#define PWMA_CTRL2_PWMX_INIT_MASK                0x400u
#define PWMA_CTRL2_PWMX_INIT_SHIFT               10
#define PWMA_CTRL2_PWM45_INIT_MASK               0x800u
#define PWMA_CTRL2_PWM45_INIT_SHIFT              11
#define PWMA_CTRL2_PWM23_INIT_MASK               0x1000u
#define PWMA_CTRL2_PWM23_INIT_SHIFT              12
#define PWMA_CTRL2_INDEP_MASK                    0x2000u
#define PWMA_CTRL2_INDEP_SHIFT                   13
#define PWMA_CTRL2_WAITEN_MASK                   0x4000u
#define PWMA_CTRL2_WAITEN_SHIFT                  14
#define PWMA_CTRL2_DBGEN_MASK                    0x8000u
#define PWMA_CTRL2_DBGEN_SHIFT                   15
/* CTRL Bit Fields */
#define PWMA_CTRL_DBLEN_MASK                     0x1u
#define PWMA_CTRL_DBLEN_SHIFT                    0
#define PWMA_CTRL_DBLX_MASK                      0x2u
#define PWMA_CTRL_DBLX_SHIFT                     1
#define PWMA_CTRL_LDMOD_MASK                     0x4u
#define PWMA_CTRL_LDMOD_SHIFT                    2
#define PWMA_CTRL_PRSC_MASK                      0x70u
#define PWMA_CTRL_PRSC_SHIFT                     4
#define PWMA_CTRL_PRSC(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_CTRL_PRSC_SHIFT))&PWMA_CTRL_PRSC_MASK)
#define PWMA_CTRL_DT_MASK                        0x300u
#define PWMA_CTRL_DT_SHIFT                       8
#define PWMA_CTRL_DT(x)                          (((uint16_t)(((uint16_t)(x))<<PWMA_CTRL_DT_SHIFT))&PWMA_CTRL_DT_MASK)
#define PWMA_CTRL_FULL_MASK                      0x400u
#define PWMA_CTRL_FULL_SHIFT                     10
#define PWMA_CTRL_HALF_MASK                      0x800u
#define PWMA_CTRL_HALF_SHIFT                     11
#define PWMA_CTRL_LDFQ_MASK                      0xF000u
#define PWMA_CTRL_LDFQ_SHIFT                     12
#define PWMA_CTRL_LDFQ(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_CTRL_LDFQ_SHIFT))&PWMA_CTRL_LDFQ_MASK)
/* VAL0 Bit Fields */
#define PWMA_VAL0_VAL0_MASK                      0xFFFFu
#define PWMA_VAL0_VAL0_SHIFT                     0
#define PWMA_VAL0_VAL0(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_VAL0_VAL0_SHIFT))&PWMA_VAL0_VAL0_MASK)
/* FRACVAL1 Bit Fields */
#define PWMA_FRACVAL1_FRACVAL1_MASK              0xF800u
#define PWMA_FRACVAL1_FRACVAL1_SHIFT             11
#define PWMA_FRACVAL1_FRACVAL1(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_FRACVAL1_FRACVAL1_SHIFT))&PWMA_FRACVAL1_FRACVAL1_MASK)
/* VAL1 Bit Fields */
#define PWMA_VAL1_VAL1_MASK                      0xFFFFu
#define PWMA_VAL1_VAL1_SHIFT                     0
#define PWMA_VAL1_VAL1(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_VAL1_VAL1_SHIFT))&PWMA_VAL1_VAL1_MASK)
/* FRACVAL2 Bit Fields */
#define PWMA_FRACVAL2_FRACVAL2_MASK              0xF800u
#define PWMA_FRACVAL2_FRACVAL2_SHIFT             11
#define PWMA_FRACVAL2_FRACVAL2(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_FRACVAL2_FRACVAL2_SHIFT))&PWMA_FRACVAL2_FRACVAL2_MASK)
/* VAL2 Bit Fields */
#define PWMA_VAL2_VAL2_MASK                      0xFFFFu
#define PWMA_VAL2_VAL2_SHIFT                     0
#define PWMA_VAL2_VAL2(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_VAL2_VAL2_SHIFT))&PWMA_VAL2_VAL2_MASK)
/* FRACVAL3 Bit Fields */
#define PWMA_FRACVAL3_FRACVAL3_MASK              0xF800u
#define PWMA_FRACVAL3_FRACVAL3_SHIFT             11
#define PWMA_FRACVAL3_FRACVAL3(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_FRACVAL3_FRACVAL3_SHIFT))&PWMA_FRACVAL3_FRACVAL3_MASK)
/* VAL3 Bit Fields */
#define PWMA_VAL3_VAL3_MASK                      0xFFFFu
#define PWMA_VAL3_VAL3_SHIFT                     0
#define PWMA_VAL3_VAL3(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_VAL3_VAL3_SHIFT))&PWMA_VAL3_VAL3_MASK)
/* FRACVAL4 Bit Fields */
#define PWMA_FRACVAL4_FRACVAL4_MASK              0xF800u
#define PWMA_FRACVAL4_FRACVAL4_SHIFT             11
#define PWMA_FRACVAL4_FRACVAL4(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_FRACVAL4_FRACVAL4_SHIFT))&PWMA_FRACVAL4_FRACVAL4_MASK)
/* VAL4 Bit Fields */
#define PWMA_VAL4_VAL4_MASK                      0xFFFFu
#define PWMA_VAL4_VAL4_SHIFT                     0
#define PWMA_VAL4_VAL4(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_VAL4_VAL4_SHIFT))&PWMA_VAL4_VAL4_MASK)
/* FRACVAL5 Bit Fields */
#define PWMA_FRACVAL5_FRACVAL5_MASK              0xF800u
#define PWMA_FRACVAL5_FRACVAL5_SHIFT             11
#define PWMA_FRACVAL5_FRACVAL5(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_FRACVAL5_FRACVAL5_SHIFT))&PWMA_FRACVAL5_FRACVAL5_MASK)
/* VAL5 Bit Fields */
#define PWMA_VAL5_VAL5_MASK                      0xFFFFu
#define PWMA_VAL5_VAL5_SHIFT                     0
#define PWMA_VAL5_VAL5(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_VAL5_VAL5_SHIFT))&PWMA_VAL5_VAL5_MASK)
/* FRCTRL Bit Fields */
#define PWMA_FRCTRL_FRAC1_EN_MASK                0x2u
#define PWMA_FRCTRL_FRAC1_EN_SHIFT               1
#define PWMA_FRCTRL_FRAC23_EN_MASK               0x4u
#define PWMA_FRCTRL_FRAC23_EN_SHIFT              2
#define PWMA_FRCTRL_FRAC45_EN_MASK               0x10u
#define PWMA_FRCTRL_FRAC45_EN_SHIFT              4
#define PWMA_FRCTRL_FRAC_PU_MASK                 0x100u
#define PWMA_FRCTRL_FRAC_PU_SHIFT                8
#define PWMA_FRCTRL_TEST_MASK                    0x8000u
#define PWMA_FRCTRL_TEST_SHIFT                   15
/* OCTRL Bit Fields */
#define PWMA_OCTRL_PWMXFS_MASK                   0x3u
#define PWMA_OCTRL_PWMXFS_SHIFT                  0
#define PWMA_OCTRL_PWMXFS(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_OCTRL_PWMXFS_SHIFT))&PWMA_OCTRL_PWMXFS_MASK)
#define PWMA_OCTRL_PWMBFS_MASK                   0xCu
#define PWMA_OCTRL_PWMBFS_SHIFT                  2
#define PWMA_OCTRL_PWMBFS(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_OCTRL_PWMBFS_SHIFT))&PWMA_OCTRL_PWMBFS_MASK)
#define PWMA_OCTRL_PWMAFS_MASK                   0x30u
#define PWMA_OCTRL_PWMAFS_SHIFT                  4
#define PWMA_OCTRL_PWMAFS(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_OCTRL_PWMAFS_SHIFT))&PWMA_OCTRL_PWMAFS_MASK)
#define PWMA_OCTRL_POLX_MASK                     0x100u
#define PWMA_OCTRL_POLX_SHIFT                    8
#define PWMA_OCTRL_POLB_MASK                     0x200u
#define PWMA_OCTRL_POLB_SHIFT                    9
#define PWMA_OCTRL_POLA_MASK                     0x400u
#define PWMA_OCTRL_POLA_SHIFT                    10
#define PWMA_OCTRL_PWMX_IN_MASK                  0x2000u
#define PWMA_OCTRL_PWMX_IN_SHIFT                 13
#define PWMA_OCTRL_PWMB_IN_MASK                  0x4000u
#define PWMA_OCTRL_PWMB_IN_SHIFT                 14
#define PWMA_OCTRL_PWMA_IN_MASK                  0x8000u
#define PWMA_OCTRL_PWMA_IN_SHIFT                 15
/* STS Bit Fields */
#define PWMA_STS_CMPF_MASK                       0x3Fu
#define PWMA_STS_CMPF_SHIFT                      0
#define PWMA_STS_CMPF(x)                         (((uint16_t)(((uint16_t)(x))<<PWMA_STS_CMPF_SHIFT))&PWMA_STS_CMPF_MASK)
#define PWMA_STS_CFX0_MASK                       0x40u
#define PWMA_STS_CFX0_SHIFT                      6
#define PWMA_STS_CFX1_MASK                       0x80u
#define PWMA_STS_CFX1_SHIFT                      7
#define PWMA_STS_CFB0_MASK                       0x100u
#define PWMA_STS_CFB0_SHIFT                      8
#define PWMA_STS_CFB1_MASK                       0x200u
#define PWMA_STS_CFB1_SHIFT                      9
#define PWMA_STS_CFA0_MASK                       0x400u
#define PWMA_STS_CFA0_SHIFT                      10
#define PWMA_STS_CFA1_MASK                       0x800u
#define PWMA_STS_CFA1_SHIFT                      11
#define PWMA_STS_RF_MASK                         0x1000u
#define PWMA_STS_RF_SHIFT                        12
#define PWMA_STS_REF_MASK                        0x2000u
#define PWMA_STS_REF_SHIFT                       13
#define PWMA_STS_RUF_MASK                        0x4000u
#define PWMA_STS_RUF_SHIFT                       14
/* INTEN Bit Fields */
#define PWMA_INTEN_CMPIE_MASK                    0x3Fu
#define PWMA_INTEN_CMPIE_SHIFT                   0
#define PWMA_INTEN_CMPIE(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_INTEN_CMPIE_SHIFT))&PWMA_INTEN_CMPIE_MASK)
#define PWMA_INTEN_CX0IE_MASK                    0x40u
#define PWMA_INTEN_CX0IE_SHIFT                   6
#define PWMA_INTEN_CX1IE_MASK                    0x80u
#define PWMA_INTEN_CX1IE_SHIFT                   7
#define PWMA_INTEN_CB0IE_MASK                    0x100u
#define PWMA_INTEN_CB0IE_SHIFT                   8
#define PWMA_INTEN_CB1IE_MASK                    0x200u
#define PWMA_INTEN_CB1IE_SHIFT                   9
#define PWMA_INTEN_CA0IE_MASK                    0x400u
#define PWMA_INTEN_CA0IE_SHIFT                   10
#define PWMA_INTEN_CA1IE_MASK                    0x800u
#define PWMA_INTEN_CA1IE_SHIFT                   11
#define PWMA_INTEN_RIE_MASK                      0x1000u
#define PWMA_INTEN_RIE_SHIFT                     12
#define PWMA_INTEN_REIE_MASK                     0x2000u
#define PWMA_INTEN_REIE_SHIFT                    13
/* DMAEN Bit Fields */
#define PWMA_DMAEN_CX0DE_MASK                    0x1u
#define PWMA_DMAEN_CX0DE_SHIFT                   0
#define PWMA_DMAEN_CX1DE_MASK                    0x2u
#define PWMA_DMAEN_CX1DE_SHIFT                   1
#define PWMA_DMAEN_CB0DE_MASK                    0x4u
#define PWMA_DMAEN_CB0DE_SHIFT                   2
#define PWMA_DMAEN_CB1DE_MASK                    0x8u
#define PWMA_DMAEN_CB1DE_SHIFT                   3
#define PWMA_DMAEN_CA0DE_MASK                    0x10u
#define PWMA_DMAEN_CA0DE_SHIFT                   4
#define PWMA_DMAEN_CA1DE_MASK                    0x20u
#define PWMA_DMAEN_CA1DE_SHIFT                   5
#define PWMA_DMAEN_CAPTDE_MASK                   0xC0u
#define PWMA_DMAEN_CAPTDE_SHIFT                  6
#define PWMA_DMAEN_CAPTDE(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_DMAEN_CAPTDE_SHIFT))&PWMA_DMAEN_CAPTDE_MASK)
#define PWMA_DMAEN_FAND_MASK                     0x100u
#define PWMA_DMAEN_FAND_SHIFT                    8
#define PWMA_DMAEN_VALDE_MASK                    0x200u
#define PWMA_DMAEN_VALDE_SHIFT                   9
/* TCTRL Bit Fields */
#define PWMA_TCTRL_OUT_TRIG_EN_MASK              0x3Fu
#define PWMA_TCTRL_OUT_TRIG_EN_SHIFT             0
#define PWMA_TCTRL_OUT_TRIG_EN(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_TCTRL_OUT_TRIG_EN_SHIFT))&PWMA_TCTRL_OUT_TRIG_EN_MASK)
#define PWMA_TCTRL_PWBOT1_MASK                   0x4000u
#define PWMA_TCTRL_PWBOT1_SHIFT                  14
#define PWMA_TCTRL_PWAOT0_MASK                   0x8000u
#define PWMA_TCTRL_PWAOT0_SHIFT                  15
/* DISMAP Bit Fields */
#define PWMA_DISMAP_DIS0A_MASK                   0xFu
#define PWMA_DISMAP_DIS0A_SHIFT                  0
#define PWMA_DISMAP_DIS0A(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_DISMAP_DIS0A_SHIFT))&PWMA_DISMAP_DIS0A_MASK)
#define PWMA_DISMAP_DIS1A_MASK                   0xFu
#define PWMA_DISMAP_DIS1A_SHIFT                  0
#define PWMA_DISMAP_DIS1A(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_DISMAP_DIS1A_SHIFT))&PWMA_DISMAP_DIS1A_MASK)
#define PWMA_DISMAP_DIS0B_MASK                   0xF0u
#define PWMA_DISMAP_DIS0B_SHIFT                  4
#define PWMA_DISMAP_DIS0B(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_DISMAP_DIS0B_SHIFT))&PWMA_DISMAP_DIS0B_MASK)
#define PWMA_DISMAP_DIS1B_MASK                   0xF0u
#define PWMA_DISMAP_DIS1B_SHIFT                  4
#define PWMA_DISMAP_DIS1B(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_DISMAP_DIS1B_SHIFT))&PWMA_DISMAP_DIS1B_MASK)
#define PWMA_DISMAP_DIS1X_MASK                   0xF00u
#define PWMA_DISMAP_DIS1X_SHIFT                  8
#define PWMA_DISMAP_DIS1X(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_DISMAP_DIS1X_SHIFT))&PWMA_DISMAP_DIS1X_MASK)
#define PWMA_DISMAP_DIS0X_MASK                   0xF00u
#define PWMA_DISMAP_DIS0X_SHIFT                  8
#define PWMA_DISMAP_DIS0X(x)                     (((uint16_t)(((uint16_t)(x))<<PWMA_DISMAP_DIS0X_SHIFT))&PWMA_DISMAP_DIS0X_MASK)
/* DTCNT0 Bit Fields */
#define PWMA_DTCNT0_DTCNT0_MASK                  0x7FFu
#define PWMA_DTCNT0_DTCNT0_SHIFT                 0
#define PWMA_DTCNT0_DTCNT0(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_DTCNT0_DTCNT0_SHIFT))&PWMA_DTCNT0_DTCNT0_MASK)
/* DTCNT1 Bit Fields */
#define PWMA_DTCNT1_DTCNT1_MASK                  0x7FFu
#define PWMA_DTCNT1_DTCNT1_SHIFT                 0
#define PWMA_DTCNT1_DTCNT1(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_DTCNT1_DTCNT1_SHIFT))&PWMA_DTCNT1_DTCNT1_MASK)
/* CAPTCTRLA Bit Fields */
#define PWMA_CAPTCTRLA_ARMA_MASK                 0x1u
#define PWMA_CAPTCTRLA_ARMA_SHIFT                0
#define PWMA_CAPTCTRLA_ONESHOTA_MASK             0x2u
#define PWMA_CAPTCTRLA_ONESHOTA_SHIFT            1
#define PWMA_CAPTCTRLA_EDGA0_MASK                0xCu
#define PWMA_CAPTCTRLA_EDGA0_SHIFT               2
#define PWMA_CAPTCTRLA_EDGA0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLA_EDGA0_SHIFT))&PWMA_CAPTCTRLA_EDGA0_MASK)
#define PWMA_CAPTCTRLA_EDGA1_MASK                0x30u
#define PWMA_CAPTCTRLA_EDGA1_SHIFT               4
#define PWMA_CAPTCTRLA_EDGA1(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLA_EDGA1_SHIFT))&PWMA_CAPTCTRLA_EDGA1_MASK)
#define PWMA_CAPTCTRLA_INP_SELA_MASK             0x40u
#define PWMA_CAPTCTRLA_INP_SELA_SHIFT            6
#define PWMA_CAPTCTRLA_EDGCNTA_EN_MASK           0x80u
#define PWMA_CAPTCTRLA_EDGCNTA_EN_SHIFT          7
#define PWMA_CAPTCTRLA_CFAWM_MASK                0x300u
#define PWMA_CAPTCTRLA_CFAWM_SHIFT               8
#define PWMA_CAPTCTRLA_CFAWM(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLA_CFAWM_SHIFT))&PWMA_CAPTCTRLA_CFAWM_MASK)
#define PWMA_CAPTCTRLA_CA0CNT_MASK               0x1C00u
#define PWMA_CAPTCTRLA_CA0CNT_SHIFT              10
#define PWMA_CAPTCTRLA_CA0CNT(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLA_CA0CNT_SHIFT))&PWMA_CAPTCTRLA_CA0CNT_MASK)
#define PWMA_CAPTCTRLA_CA1CNT_MASK               0xE000u
#define PWMA_CAPTCTRLA_CA1CNT_SHIFT              13
#define PWMA_CAPTCTRLA_CA1CNT(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLA_CA1CNT_SHIFT))&PWMA_CAPTCTRLA_CA1CNT_MASK)
/* CAPTCOMPA Bit Fields */
#define PWMA_CAPTCOMPA_EDGCMPA_MASK              0xFFu
#define PWMA_CAPTCOMPA_EDGCMPA_SHIFT             0
#define PWMA_CAPTCOMPA_EDGCMPA(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCOMPA_EDGCMPA_SHIFT))&PWMA_CAPTCOMPA_EDGCMPA_MASK)
#define PWMA_CAPTCOMPA_EDGCNTA_MASK              0xFF00u
#define PWMA_CAPTCOMPA_EDGCNTA_SHIFT             8
#define PWMA_CAPTCOMPA_EDGCNTA(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCOMPA_EDGCNTA_SHIFT))&PWMA_CAPTCOMPA_EDGCNTA_MASK)
/* CAPTCTRLB Bit Fields */
#define PWMA_CAPTCTRLB_ARMB_MASK                 0x1u
#define PWMA_CAPTCTRLB_ARMB_SHIFT                0
#define PWMA_CAPTCTRLB_ONESHOTB_MASK             0x2u
#define PWMA_CAPTCTRLB_ONESHOTB_SHIFT            1
#define PWMA_CAPTCTRLB_EDGB0_MASK                0xCu
#define PWMA_CAPTCTRLB_EDGB0_SHIFT               2
#define PWMA_CAPTCTRLB_EDGB0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLB_EDGB0_SHIFT))&PWMA_CAPTCTRLB_EDGB0_MASK)
#define PWMA_CAPTCTRLB_EDGB1_MASK                0x30u
#define PWMA_CAPTCTRLB_EDGB1_SHIFT               4
#define PWMA_CAPTCTRLB_EDGB1(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLB_EDGB1_SHIFT))&PWMA_CAPTCTRLB_EDGB1_MASK)
#define PWMA_CAPTCTRLB_INP_SELB_MASK             0x40u
#define PWMA_CAPTCTRLB_INP_SELB_SHIFT            6
#define PWMA_CAPTCTRLB_EDGCNTB_EN_MASK           0x80u
#define PWMA_CAPTCTRLB_EDGCNTB_EN_SHIFT          7
#define PWMA_CAPTCTRLB_CFBWM_MASK                0x300u
#define PWMA_CAPTCTRLB_CFBWM_SHIFT               8
#define PWMA_CAPTCTRLB_CFBWM(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLB_CFBWM_SHIFT))&PWMA_CAPTCTRLB_CFBWM_MASK)
#define PWMA_CAPTCTRLB_CB0CNT_MASK               0x1C00u
#define PWMA_CAPTCTRLB_CB0CNT_SHIFT              10
#define PWMA_CAPTCTRLB_CB0CNT(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLB_CB0CNT_SHIFT))&PWMA_CAPTCTRLB_CB0CNT_MASK)
#define PWMA_CAPTCTRLB_CB1CNT_MASK               0xE000u
#define PWMA_CAPTCTRLB_CB1CNT_SHIFT              13
#define PWMA_CAPTCTRLB_CB1CNT(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLB_CB1CNT_SHIFT))&PWMA_CAPTCTRLB_CB1CNT_MASK)
/* CAPTCOMPB Bit Fields */
#define PWMA_CAPTCOMPB_EDGCMPB_MASK              0xFFu
#define PWMA_CAPTCOMPB_EDGCMPB_SHIFT             0
#define PWMA_CAPTCOMPB_EDGCMPB(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCOMPB_EDGCMPB_SHIFT))&PWMA_CAPTCOMPB_EDGCMPB_MASK)
#define PWMA_CAPTCOMPB_EDGCNTB_MASK              0xFF00u
#define PWMA_CAPTCOMPB_EDGCNTB_SHIFT             8
#define PWMA_CAPTCOMPB_EDGCNTB(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCOMPB_EDGCNTB_SHIFT))&PWMA_CAPTCOMPB_EDGCNTB_MASK)
/* CAPTCTRLX Bit Fields */
#define PWMA_CAPTCTRLX_ARMX_MASK                 0x1u
#define PWMA_CAPTCTRLX_ARMX_SHIFT                0
#define PWMA_CAPTCTRLX_ONESHOTX_MASK             0x2u
#define PWMA_CAPTCTRLX_ONESHOTX_SHIFT            1
#define PWMA_CAPTCTRLX_EDGX0_MASK                0xCu
#define PWMA_CAPTCTRLX_EDGX0_SHIFT               2
#define PWMA_CAPTCTRLX_EDGX0(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLX_EDGX0_SHIFT))&PWMA_CAPTCTRLX_EDGX0_MASK)
#define PWMA_CAPTCTRLX_EDGX1_MASK                0x30u
#define PWMA_CAPTCTRLX_EDGX1_SHIFT               4
#define PWMA_CAPTCTRLX_EDGX1(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLX_EDGX1_SHIFT))&PWMA_CAPTCTRLX_EDGX1_MASK)
#define PWMA_CAPTCTRLX_INP_SELX_MASK             0x40u
#define PWMA_CAPTCTRLX_INP_SELX_SHIFT            6
#define PWMA_CAPTCTRLX_EDGCNTX_EN_MASK           0x80u
#define PWMA_CAPTCTRLX_EDGCNTX_EN_SHIFT          7
#define PWMA_CAPTCTRLX_CFXWM_MASK                0x300u
#define PWMA_CAPTCTRLX_CFXWM_SHIFT               8
#define PWMA_CAPTCTRLX_CFXWM(x)                  (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLX_CFXWM_SHIFT))&PWMA_CAPTCTRLX_CFXWM_MASK)
#define PWMA_CAPTCTRLX_CX0CNT_MASK               0x1C00u
#define PWMA_CAPTCTRLX_CX0CNT_SHIFT              10
#define PWMA_CAPTCTRLX_CX0CNT(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLX_CX0CNT_SHIFT))&PWMA_CAPTCTRLX_CX0CNT_MASK)
#define PWMA_CAPTCTRLX_CX1CNT_MASK               0xE000u
#define PWMA_CAPTCTRLX_CX1CNT_SHIFT              13
#define PWMA_CAPTCTRLX_CX1CNT(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCTRLX_CX1CNT_SHIFT))&PWMA_CAPTCTRLX_CX1CNT_MASK)
/* CAPTCOMPX Bit Fields */
#define PWMA_CAPTCOMPX_EDGCMPX_MASK              0xFFu
#define PWMA_CAPTCOMPX_EDGCMPX_SHIFT             0
#define PWMA_CAPTCOMPX_EDGCMPX(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCOMPX_EDGCMPX_SHIFT))&PWMA_CAPTCOMPX_EDGCMPX_MASK)
#define PWMA_CAPTCOMPX_EDGCNTX_MASK              0xFF00u
#define PWMA_CAPTCOMPX_EDGCNTX_SHIFT             8
#define PWMA_CAPTCOMPX_EDGCNTX(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CAPTCOMPX_EDGCNTX_SHIFT))&PWMA_CAPTCOMPX_EDGCNTX_MASK)
/* CVAL0 Bit Fields */
#define PWMA_CVAL0_CAPTVAL0_MASK                 0xFFFFu
#define PWMA_CVAL0_CAPTVAL0_SHIFT                0
#define PWMA_CVAL0_CAPTVAL0(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL0_CAPTVAL0_SHIFT))&PWMA_CVAL0_CAPTVAL0_MASK)
/* CVAL0CYC Bit Fields */
#define PWMA_CVAL0CYC_CVAL0CYC_MASK              0xFu
#define PWMA_CVAL0CYC_CVAL0CYC_SHIFT             0
#define PWMA_CVAL0CYC_CVAL0CYC(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL0CYC_CVAL0CYC_SHIFT))&PWMA_CVAL0CYC_CVAL0CYC_MASK)
/* CVAL1 Bit Fields */
#define PWMA_CVAL1_CAPTVAL1_MASK                 0xFFFFu
#define PWMA_CVAL1_CAPTVAL1_SHIFT                0
#define PWMA_CVAL1_CAPTVAL1(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL1_CAPTVAL1_SHIFT))&PWMA_CVAL1_CAPTVAL1_MASK)
/* CVAL1CYC Bit Fields */
#define PWMA_CVAL1CYC_CVAL1CYC_MASK              0xFu
#define PWMA_CVAL1CYC_CVAL1CYC_SHIFT             0
#define PWMA_CVAL1CYC_CVAL1CYC(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL1CYC_CVAL1CYC_SHIFT))&PWMA_CVAL1CYC_CVAL1CYC_MASK)
/* CVAL2 Bit Fields */
#define PWMA_CVAL2_CAPTVAL2_MASK                 0xFFFFu
#define PWMA_CVAL2_CAPTVAL2_SHIFT                0
#define PWMA_CVAL2_CAPTVAL2(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL2_CAPTVAL2_SHIFT))&PWMA_CVAL2_CAPTVAL2_MASK)
/* CVAL2CYC Bit Fields */
#define PWMA_CVAL2CYC_CVAL2CYC_MASK              0xFu
#define PWMA_CVAL2CYC_CVAL2CYC_SHIFT             0
#define PWMA_CVAL2CYC_CVAL2CYC(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL2CYC_CVAL2CYC_SHIFT))&PWMA_CVAL2CYC_CVAL2CYC_MASK)
/* CVAL3 Bit Fields */
#define PWMA_CVAL3_CAPTVAL3_MASK                 0xFFFFu
#define PWMA_CVAL3_CAPTVAL3_SHIFT                0
#define PWMA_CVAL3_CAPTVAL3(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL3_CAPTVAL3_SHIFT))&PWMA_CVAL3_CAPTVAL3_MASK)
/* CVAL3CYC Bit Fields */
#define PWMA_CVAL3CYC_CVAL3CYC_MASK              0xFu
#define PWMA_CVAL3CYC_CVAL3CYC_SHIFT             0
#define PWMA_CVAL3CYC_CVAL3CYC(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL3CYC_CVAL3CYC_SHIFT))&PWMA_CVAL3CYC_CVAL3CYC_MASK)
/* CVAL4 Bit Fields */
#define PWMA_CVAL4_CAPTVAL4_MASK                 0xFFFFu
#define PWMA_CVAL4_CAPTVAL4_SHIFT                0
#define PWMA_CVAL4_CAPTVAL4(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL4_CAPTVAL4_SHIFT))&PWMA_CVAL4_CAPTVAL4_MASK)
/* CVAL4CYC Bit Fields */
#define PWMA_CVAL4CYC_CVAL4CYC_MASK              0xFu
#define PWMA_CVAL4CYC_CVAL4CYC_SHIFT             0
#define PWMA_CVAL4CYC_CVAL4CYC(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL4CYC_CVAL4CYC_SHIFT))&PWMA_CVAL4CYC_CVAL4CYC_MASK)
/* CVAL5 Bit Fields */
#define PWMA_CVAL5_CAPTVAL5_MASK                 0xFFFFu
#define PWMA_CVAL5_CAPTVAL5_SHIFT                0
#define PWMA_CVAL5_CAPTVAL5(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL5_CAPTVAL5_SHIFT))&PWMA_CVAL5_CAPTVAL5_MASK)
/* CVAL5CYC Bit Fields */
#define PWMA_CVAL5CYC_CVAL5CYC_MASK              0xFu
#define PWMA_CVAL5CYC_CVAL5CYC_SHIFT             0
#define PWMA_CVAL5CYC_CVAL5CYC(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_CVAL5CYC_CVAL5CYC_SHIFT))&PWMA_CVAL5CYC_CVAL5CYC_MASK)
/* OUTEN Bit Fields */
#define PWMA_OUTEN_PWMX_EN_MASK                  0xFu
