Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
#define PWMA_OUTEN_PWMX_EN_SHIFT                 0
#define PWMA_OUTEN_PWMX_EN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_OUTEN_PWMX_EN_SHIFT))&PWMA_OUTEN_PWMX_EN_MASK)
#define PWMA_OUTEN_PWMB_EN_MASK                  0xF0u
#define PWMA_OUTEN_PWMB_EN_SHIFT                 4
#define PWMA_OUTEN_PWMB_EN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_OUTEN_PWMB_EN_SHIFT))&PWMA_OUTEN_PWMB_EN_MASK)
#define PWMA_OUTEN_PWMA_EN_MASK                  0xF00u
#define PWMA_OUTEN_PWMA_EN_SHIFT                 8
#define PWMA_OUTEN_PWMA_EN(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_OUTEN_PWMA_EN_SHIFT))&PWMA_OUTEN_PWMA_EN_MASK)
/* MASK Bit Fields */
#define PWMA_MASK_MASKX_MASK                     0xFu
#define PWMA_MASK_MASKX_SHIFT                    0
#define PWMA_MASK_MASKX(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_MASKX_SHIFT))&PWMA_MASK_MASKX_MASK)
#define PWMA_MASK_MASKB_MASK                     0xF0u
#define PWMA_MASK_MASKB_SHIFT                    4
#define PWMA_MASK_MASKB(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_MASKB_SHIFT))&PWMA_MASK_MASKB_MASK)
#define PWMA_MASK_MASKA_MASK                     0xF00u
#define PWMA_MASK_MASKA_SHIFT                    8
#define PWMA_MASK_MASKA(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_MASKA_SHIFT))&PWMA_MASK_MASKA_MASK)
#define PWMA_MASK_UPDATE_MASK_MASK               0xF000u
#define PWMA_MASK_UPDATE_MASK_SHIFT              12
#define PWMA_MASK_UPDATE_MASK(x)                 (((uint16_t)(((uint16_t)(x))<<PWMA_MASK_UPDATE_MASK_SHIFT))&PWMA_MASK_UPDATE_MASK_MASK)
/* SWCOUT Bit Fields */
#define PWMA_SWCOUT_SM0OUT45_MASK                0x1u
#define PWMA_SWCOUT_SM0OUT45_SHIFT               0
#define PWMA_SWCOUT_SM0OUT23_MASK                0x2u
#define PWMA_SWCOUT_SM0OUT23_SHIFT               1
#define PWMA_SWCOUT_SM1OUT45_MASK                0x4u
#define PWMA_SWCOUT_SM1OUT45_SHIFT               2
#define PWMA_SWCOUT_SM1OUT23_MASK                0x8u
#define PWMA_SWCOUT_SM1OUT23_SHIFT               3
#define PWMA_SWCOUT_SM2OUT45_MASK                0x10u
#define PWMA_SWCOUT_SM2OUT45_SHIFT               4
#define PWMA_SWCOUT_SM2OUT23_MASK                0x20u
#define PWMA_SWCOUT_SM2OUT23_SHIFT               5
#define PWMA_SWCOUT_SM3OUT45_MASK                0x40u
#define PWMA_SWCOUT_SM3OUT45_SHIFT               6
#define PWMA_SWCOUT_SM3OUT23_MASK                0x80u
#define PWMA_SWCOUT_SM3OUT23_SHIFT               7
/* DTSRCSEL Bit Fields */
#define PWMA_DTSRCSEL_SM0SEL45_MASK              0x3u
#define PWMA_DTSRCSEL_SM0SEL45_SHIFT             0
#define PWMA_DTSRCSEL_SM0SEL45(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM0SEL45_SHIFT))&PWMA_DTSRCSEL_SM0SEL45_MASK)
#define PWMA_DTSRCSEL_SM0SEL23_MASK              0xCu
#define PWMA_DTSRCSEL_SM0SEL23_SHIFT             2
#define PWMA_DTSRCSEL_SM0SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM0SEL23_SHIFT))&PWMA_DTSRCSEL_SM0SEL23_MASK)
#define PWMA_DTSRCSEL_SM1SEL45_MASK              0x30u
#define PWMA_DTSRCSEL_SM1SEL45_SHIFT             4
#define PWMA_DTSRCSEL_SM1SEL45(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM1SEL45_SHIFT))&PWMA_DTSRCSEL_SM1SEL45_MASK)
#define PWMA_DTSRCSEL_SM1SEL23_MASK              0xC0u
#define PWMA_DTSRCSEL_SM1SEL23_SHIFT             6
#define PWMA_DTSRCSEL_SM1SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM1SEL23_SHIFT))&PWMA_DTSRCSEL_SM1SEL23_MASK)
#define PWMA_DTSRCSEL_SM2SEL45_MASK              0x300u
#define PWMA_DTSRCSEL_SM2SEL45_SHIFT             8
#define PWMA_DTSRCSEL_SM2SEL45(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM2SEL45_SHIFT))&PWMA_DTSRCSEL_SM2SEL45_MASK)
#define PWMA_DTSRCSEL_SM2SEL23_MASK              0xC00u
#define PWMA_DTSRCSEL_SM2SEL23_SHIFT             10
#define PWMA_DTSRCSEL_SM2SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM2SEL23_SHIFT))&PWMA_DTSRCSEL_SM2SEL23_MASK)
#define PWMA_DTSRCSEL_SM3SEL45_MASK              0x3000u
#define PWMA_DTSRCSEL_SM3SEL45_SHIFT             12
#define PWMA_DTSRCSEL_SM3SEL45(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM3SEL45_SHIFT))&PWMA_DTSRCSEL_SM3SEL45_MASK)
#define PWMA_DTSRCSEL_SM3SEL23_MASK              0xC000u
#define PWMA_DTSRCSEL_SM3SEL23_SHIFT             14
#define PWMA_DTSRCSEL_SM3SEL23(x)                (((uint16_t)(((uint16_t)(x))<<PWMA_DTSRCSEL_SM3SEL23_SHIFT))&PWMA_DTSRCSEL_SM3SEL23_MASK)
/* MCTRL Bit Fields */
#define PWMA_MCTRL_LDOK_MASK                     0xFu
#define PWMA_MCTRL_LDOK_SHIFT                    0
#define PWMA_MCTRL_LDOK(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_LDOK_SHIFT))&PWMA_MCTRL_LDOK_MASK)
#define PWMA_MCTRL_CLDOK_MASK                    0xF0u
#define PWMA_MCTRL_CLDOK_SHIFT                   4
#define PWMA_MCTRL_CLDOK(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_CLDOK_SHIFT))&PWMA_MCTRL_CLDOK_MASK)
#define PWMA_MCTRL_RUN_MASK                      0xF00u
#define PWMA_MCTRL_RUN_SHIFT                     8
#define PWMA_MCTRL_RUN(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_RUN_SHIFT))&PWMA_MCTRL_RUN_MASK)
#define PWMA_MCTRL_IPOL_MASK                     0xF000u
#define PWMA_MCTRL_IPOL_SHIFT                    12
#define PWMA_MCTRL_IPOL(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL_IPOL_SHIFT))&PWMA_MCTRL_IPOL_MASK)
/* MCTRL2 Bit Fields */
#define PWMA_MCTRL2_MONPLL_MASK                  0x3u
#define PWMA_MCTRL2_MONPLL_SHIFT                 0
#define PWMA_MCTRL2_MONPLL(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_MCTRL2_MONPLL_SHIFT))&PWMA_MCTRL2_MONPLL_MASK)
/* FCTRL Bit Fields */
#define PWMA_FCTRL_FIE_MASK                      0xFu
#define PWMA_FCTRL_FIE_SHIFT                     0
#define PWMA_FCTRL_FIE(x)                        (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FIE_SHIFT))&PWMA_FCTRL_FIE_MASK)
#define PWMA_FCTRL_FSAFE_MASK                    0xF0u
#define PWMA_FCTRL_FSAFE_SHIFT                   4
#define PWMA_FCTRL_FSAFE(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FSAFE_SHIFT))&PWMA_FCTRL_FSAFE_MASK)
#define PWMA_FCTRL_FAUTO_MASK                    0xF00u
#define PWMA_FCTRL_FAUTO_SHIFT                   8
#define PWMA_FCTRL_FAUTO(x)                      (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FAUTO_SHIFT))&PWMA_FCTRL_FAUTO_MASK)
#define PWMA_FCTRL_FLVL_MASK                     0xF000u
#define PWMA_FCTRL_FLVL_SHIFT                    12
#define PWMA_FCTRL_FLVL(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL_FLVL_SHIFT))&PWMA_FCTRL_FLVL_MASK)
/* FSTS Bit Fields */
#define PWMA_FSTS_FFLAG_MASK                     0xFu
#define PWMA_FSTS_FFLAG_SHIFT                    0
#define PWMA_FSTS_FFLAG(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FFLAG_SHIFT))&PWMA_FSTS_FFLAG_MASK)
#define PWMA_FSTS_FFULL_MASK                     0xF0u
#define PWMA_FSTS_FFULL_SHIFT                    4
#define PWMA_FSTS_FFULL(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FFULL_SHIFT))&PWMA_FSTS_FFULL_MASK)
#define PWMA_FSTS_FFPIN_MASK                     0xF00u
#define PWMA_FSTS_FFPIN_SHIFT                    8
#define PWMA_FSTS_FFPIN(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FFPIN_SHIFT))&PWMA_FSTS_FFPIN_MASK)
#define PWMA_FSTS_FHALF_MASK                     0xF000u
#define PWMA_FSTS_FHALF_SHIFT                    12
#define PWMA_FSTS_FHALF(x)                       (((uint16_t)(((uint16_t)(x))<<PWMA_FSTS_FHALF_SHIFT))&PWMA_FSTS_FHALF_MASK)
/* FFILT Bit Fields */
#define PWMA_FFILT_FILT_PER_MASK                 0xFFu
#define PWMA_FFILT_FILT_PER_SHIFT                0
#define PWMA_FFILT_FILT_PER(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_FFILT_FILT_PER_SHIFT))&PWMA_FFILT_FILT_PER_MASK)
#define PWMA_FFILT_FILT_CNT_MASK                 0x700u
#define PWMA_FFILT_FILT_CNT_SHIFT                8
#define PWMA_FFILT_FILT_CNT(x)                   (((uint16_t)(((uint16_t)(x))<<PWMA_FFILT_FILT_CNT_SHIFT))&PWMA_FFILT_FILT_CNT_MASK)
#define PWMA_FFILT_GSTR_MASK                     0x8000u
#define PWMA_FFILT_GSTR_SHIFT                    15
/* FTST Bit Fields */
#define PWMA_FTST_FTEST_MASK                     0x1u
#define PWMA_FTST_FTEST_SHIFT                    0
/* FCTRL2 Bit Fields */
#define PWMA_FCTRL2_NOCOMB_MASK                  0xFu
#define PWMA_FCTRL2_NOCOMB_SHIFT                 0
#define PWMA_FCTRL2_NOCOMB(x)                    (((uint16_t)(((uint16_t)(x))<<PWMA_FCTRL2_NOCOMB_SHIFT))&PWMA_FCTRL2_NOCOMB_MASK)

/*!
 * @}
 */ /* end of group PWMA_Register_Masks */


/* PWMA - Peripheral instance base addresses */
/** Peripheral PWMA base pointer */
#define PWMA_BASE_PTR                            ((PWMA_MemMapPtr)0x40033000u)
/** Array initializer of PWMA peripheral base pointers */
#define PWMA_BASE_PTRS                           { PWMA_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- PWMA - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PWMA_Register_Accessor_Macros PWMA - Register accessor macros
 * @{
 */


