Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
/* PWMA - Register instance definitions */
/* PWMA */
#define PWMA_SM0CNT                              PWMA_CNT_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0INIT                             PWMA_INIT_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CTRL2                            PWMA_CTRL2_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CTRL                             PWMA_CTRL_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0VAL0                             PWMA_VAL0_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0FRACVAL1                         PWMA_FRACVAL1_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0VAL1                             PWMA_VAL1_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0FRACVAL2                         PWMA_FRACVAL2_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0VAL2                             PWMA_VAL2_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0FRACVAL3                         PWMA_FRACVAL3_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0VAL3                             PWMA_VAL3_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0FRACVAL4                         PWMA_FRACVAL4_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0VAL4                             PWMA_VAL4_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0FRACVAL5                         PWMA_FRACVAL5_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0VAL5                             PWMA_VAL5_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0FRCTRL                           PWMA_FRCTRL_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0OCTRL                            PWMA_OCTRL_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0STS                              PWMA_STS_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0INTEN                            PWMA_INTEN_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0DMAEN                            PWMA_DMAEN_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0TCTRL                            PWMA_TCTRL_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0DISMAP0                          PWMA_DISMAP_REG(PWMA_BASE_PTR,0,0)
//#define PWMA_SM0DISMAP1                          PWMA_DISMAP_REG(PWMA_BASE_PTR,0,1)
#define PWMA_SM0DTCNT0                           PWMA_DTCNT0_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0DTCNT1                           PWMA_DTCNT1_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CAPTCTRLA                        PWMA_CAPTCTRLA_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CAPTCOMPA                        PWMA_CAPTCOMPA_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CAPTCTRLB                        PWMA_CAPTCTRLB_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CAPTCOMPB                        PWMA_CAPTCOMPB_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CAPTCTRLX                        PWMA_CAPTCTRLX_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CAPTCOMPX                        PWMA_CAPTCOMPX_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL0                            PWMA_CVAL0_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL0CYC                         PWMA_CVAL0CYC_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL1                            PWMA_CVAL1_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL1CYC                         PWMA_CVAL1CYC_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL2                            PWMA_CVAL2_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL2CYC                         PWMA_CVAL2CYC_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL3                            PWMA_CVAL3_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL3CYC                         PWMA_CVAL3CYC_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL4                            PWMA_CVAL4_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL4CYC                         PWMA_CVAL4CYC_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL5                            PWMA_CVAL5_REG(PWMA_BASE_PTR,0)
#define PWMA_SM0CVAL5CYC                         PWMA_CVAL5CYC_REG(PWMA_BASE_PTR,0)
#define PWMA_SM1CNT                              PWMA_CNT_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1INIT                             PWMA_INIT_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CTRL2                            PWMA_CTRL2_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CTRL                             PWMA_CTRL_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1VAL0                             PWMA_VAL0_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1FRACVAL1                         PWMA_FRACVAL1_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1VAL1                             PWMA_VAL1_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1FRACVAL2                         PWMA_FRACVAL2_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1VAL2                             PWMA_VAL2_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1FRACVAL3                         PWMA_FRACVAL3_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1VAL3                             PWMA_VAL3_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1FRACVAL4                         PWMA_FRACVAL4_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1VAL4                             PWMA_VAL4_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1FRACVAL5                         PWMA_FRACVAL5_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1VAL5                             PWMA_VAL5_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1FRCTRL                           PWMA_FRCTRL_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1OCTRL                            PWMA_OCTRL_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1STS                              PWMA_STS_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1INTEN                            PWMA_INTEN_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1DMAEN                            PWMA_DMAEN_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1TCTRL                            PWMA_TCTRL_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1DISMAP0                          PWMA_DISMAP_REG(PWMA_BASE_PTR,1,0)
#define PWMA_SM1DISMAP1                          PWMA_DISMAP_REG(PWMA_BASE_PTR,1,1)
#define PWMA_SM1DTCNT0                           PWMA_DTCNT0_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1DTCNT1                           PWMA_DTCNT1_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CAPTCTRLA                        PWMA_CAPTCTRLA_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CAPTCOMPA                        PWMA_CAPTCOMPA_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CAPTCTRLB                        PWMA_CAPTCTRLB_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CAPTCOMPB                        PWMA_CAPTCOMPB_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CAPTCTRLX                        PWMA_CAPTCTRLX_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CAPTCOMPX                        PWMA_CAPTCOMPX_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL0                            PWMA_CVAL0_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL0CYC                         PWMA_CVAL0CYC_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL1                            PWMA_CVAL1_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL1CYC                         PWMA_CVAL1CYC_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL2                            PWMA_CVAL2_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL2CYC                         PWMA_CVAL2CYC_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL3                            PWMA_CVAL3_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL3CYC                         PWMA_CVAL3CYC_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL4                            PWMA_CVAL4_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL4CYC                         PWMA_CVAL4CYC_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL5                            PWMA_CVAL5_REG(PWMA_BASE_PTR,1)
#define PWMA_SM1CVAL5CYC                         PWMA_CVAL5CYC_REG(PWMA_BASE_PTR,1)
#define PWMA_SM2CNT                              PWMA_CNT_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2INIT                             PWMA_INIT_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CTRL2                            PWMA_CTRL2_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CTRL                             PWMA_CTRL_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2VAL0                             PWMA_VAL0_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2FRACVAL1                         PWMA_FRACVAL1_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2VAL1                             PWMA_VAL1_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2FRACVAL2                         PWMA_FRACVAL2_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2VAL2                             PWMA_VAL2_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2FRACVAL3                         PWMA_FRACVAL3_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2VAL3                             PWMA_VAL3_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2FRACVAL4                         PWMA_FRACVAL4_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2VAL4                             PWMA_VAL4_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2FRACVAL5                         PWMA_FRACVAL5_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2VAL5                             PWMA_VAL5_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2FRCTRL                           PWMA_FRCTRL_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2OCTRL                            PWMA_OCTRL_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2STS                              PWMA_STS_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2INTEN                            PWMA_INTEN_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2DMAEN                            PWMA_DMAEN_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2TCTRL                            PWMA_TCTRL_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2DISMAP0                          PWMA_DISMAP_REG(PWMA_BASE_PTR,2,0)
#define PWMA_SM2DISMAP1                          PWMA_DISMAP_REG(PWMA_BASE_PTR,2,1)
#define PWMA_SM2DTCNT0                           PWMA_DTCNT0_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2DTCNT1                           PWMA_DTCNT1_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CAPTCTRLA                        PWMA_CAPTCTRLA_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CAPTCOMPA                        PWMA_CAPTCOMPA_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CAPTCTRLB                        PWMA_CAPTCTRLB_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CAPTCOMPB                        PWMA_CAPTCOMPB_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CAPTCTRLX                        PWMA_CAPTCTRLX_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CAPTCOMPX                        PWMA_CAPTCOMPX_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL0                            PWMA_CVAL0_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL0CYC                         PWMA_CVAL0CYC_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL1                            PWMA_CVAL1_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL1CYC                         PWMA_CVAL1CYC_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL2                            PWMA_CVAL2_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL2CYC                         PWMA_CVAL2CYC_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL3                            PWMA_CVAL3_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL3CYC                         PWMA_CVAL3CYC_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL4                            PWMA_CVAL4_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL4CYC                         PWMA_CVAL4CYC_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL5                            PWMA_CVAL5_REG(PWMA_BASE_PTR,2)
#define PWMA_SM2CVAL5CYC                         PWMA_CVAL5CYC_REG(PWMA_BASE_PTR,2)
#define PWMA_SM3CNT                              PWMA_CNT_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3INIT                             PWMA_INIT_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CTRL2                            PWMA_CTRL2_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CTRL                             PWMA_CTRL_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3VAL0                             PWMA_VAL0_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3FRACVAL1                         PWMA_FRACVAL1_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3VAL1                             PWMA_VAL1_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3FRACVAL2                         PWMA_FRACVAL2_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3VAL2                             PWMA_VAL2_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3FRACVAL3                         PWMA_FRACVAL3_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3VAL3                             PWMA_VAL3_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3FRACVAL4                         PWMA_FRACVAL4_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3VAL4                             PWMA_VAL4_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3FRACVAL5                         PWMA_FRACVAL5_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3VAL5                             PWMA_VAL5_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3FRCTRL                           PWMA_FRCTRL_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3OCTRL                            PWMA_OCTRL_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3STS                              PWMA_STS_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3INTEN                            PWMA_INTEN_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3DMAEN                            PWMA_DMAEN_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3TCTRL                            PWMA_TCTRL_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3DISMAP0                          PWMA_DISMAP_REG(PWMA_BASE_PTR,3,0)
#define PWMA_SM3DISMAP1                          PWMA_DISMAP_REG(PWMA_BASE_PTR,3,1)
#define PWMA_SM3DTCNT0                           PWMA_DTCNT0_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3DTCNT1                           PWMA_DTCNT1_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CAPTCTRLA                        PWMA_CAPTCTRLA_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CAPTCOMPA                        PWMA_CAPTCOMPA_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CAPTCTRLB                        PWMA_CAPTCTRLB_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CAPTCOMPB                        PWMA_CAPTCOMPB_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CAPTCTRLX                        PWMA_CAPTCTRLX_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CAPTCOMPX                        PWMA_CAPTCOMPX_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL0                            PWMA_CVAL0_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL0CYC                         PWMA_CVAL0CYC_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL1                            PWMA_CVAL1_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL1CYC                         PWMA_CVAL1CYC_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL2                            PWMA_CVAL2_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL2CYC                         PWMA_CVAL2CYC_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL3                            PWMA_CVAL3_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL3CYC                         PWMA_CVAL3CYC_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL4                            PWMA_CVAL4_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL4CYC                         PWMA_CVAL4CYC_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL5                            PWMA_CVAL5_REG(PWMA_BASE_PTR,3)
#define PWMA_SM3CVAL5CYC                         PWMA_CVAL5CYC_REG(PWMA_BASE_PTR,3)
#define PWMA_OUTEN                               PWMA_OUTEN_REG(PWMA_BASE_PTR)
#define PWMA_MASK                                PWMA_MASK_REG(PWMA_BASE_PTR)
#define PWMA_SWCOUT                              PWMA_SWCOUT_REG(PWMA_BASE_PTR)
#define PWMA_DTSRCSEL                            PWMA_DTSRCSEL_REG(PWMA_BASE_PTR)
#define PWMA_MCTRL                               PWMA_MCTRL_REG(PWMA_BASE_PTR)
#define PWMA_MCTRL2                              PWMA_MCTRL2_REG(PWMA_BASE_PTR)
#define PWMA_FCTRL                               PWMA_FCTRL_REG(PWMA_BASE_PTR,0)
#define PWMA_FSTS                                PWMA_FSTS_REG(PWMA_BASE_PTR,0)
#define PWMA_FFILT                               PWMA_FFILT_REG(PWMA_BASE_PTR,0)
#define PWMA_FTST                                PWMA_FTST_REG(PWMA_BASE_PTR,0)
#define PWMA_FCTRL2                              PWMA_FCTRL2_REG(PWMA_BASE_PTR,0)

/* PWMA - Register array accessors */
#define PWMA_CNT(index)                          PWMA_CNT_REG(PWMA_BASE_PTR,index)
#define PWMA_INIT(index)                         PWMA_INIT_REG(PWMA_BASE_PTR,index)
#define PWMA_CTRL2(index)                        PWMA_CTRL2_REG(PWMA_BASE_PTR,index)
#define PWMA_CTRL(index)                         PWMA_CTRL_REG(PWMA_BASE_PTR,index)
#define PWMA_VAL0(index)                         PWMA_VAL0_REG(PWMA_BASE_PTR,index)
#define PWMA_FRACVAL1(index)                     PWMA_FRACVAL1_REG(PWMA_BASE_PTR,index)
#define PWMA_VAL1(index)                         PWMA_VAL1_REG(PWMA_BASE_PTR,index)
#define PWMA_FRACVAL2(index)                     PWMA_FRACVAL2_REG(PWMA_BASE_PTR,index)
#define PWMA_VAL2(index)                         PWMA_VAL2_REG(PWMA_BASE_PTR,index)
#define PWMA_FRACVAL3(index)                     PWMA_FRACVAL3_REG(PWMA_BASE_PTR,index)
#define PWMA_VAL3(index)                         PWMA_VAL3_REG(PWMA_BASE_PTR,index)
#define PWMA_FRACVAL4(index)                     PWMA_FRACVAL4_REG(PWMA_BASE_PTR,index)
#define PWMA_VAL4(index)                         PWMA_VAL4_REG(PWMA_BASE_PTR,index)
#define PWMA_FRACVAL5(index)                     PWMA_FRACVAL5_REG(PWMA_BASE_PTR,index)
#define PWMA_VAL5(index)                         PWMA_VAL5_REG(PWMA_BASE_PTR,index)
#define PWMA_FRCTRL(index)                       PWMA_FRCTRL_REG(PWMA_BASE_PTR,index)
#define PWMA_OCTRL(index)                        PWMA_OCTRL_REG(PWMA_BASE_PTR,index)
#define PWMA_STS(index)                          PWMA_STS_REG(PWMA_BASE_PTR,index)
#define PWMA_INTEN(index)                        PWMA_INTEN_REG(PWMA_BASE_PTR,index)
#define PWMA_DMAEN(index)                        PWMA_DMAEN_REG(PWMA_BASE_PTR,index)
#define PWMA_TCTRL(index)                        PWMA_TCTRL_REG(PWMA_BASE_PTR,index)
#define PWMA_DISMAP(index,index2)                PWMA_DISMAP_REG(PWMA_BASE_PTR,index,index2)
#define PWMA_DTCNT0(index)                       PWMA_DTCNT0_REG(PWMA_BASE_PTR,index)
#define PWMA_DTCNT1(index)                       PWMA_DTCNT1_REG(PWMA_BASE_PTR,index)
#define PWMA_CAPTCTRLA(index)                    PWMA_CAPTCTRLA_REG(PWMA_BASE_PTR,index)
#define PWMA_CAPTCOMPA(index)                    PWMA_CAPTCOMPA_REG(PWMA_BASE_PTR,index)
#define PWMA_CAPTCTRLB(index)                    PWMA_CAPTCTRLB_REG(PWMA_BASE_PTR,index)
#define PWMA_CAPTCOMPB(index)                    PWMA_CAPTCOMPB_REG(PWMA_BASE_PTR,index)
#define PWMA_CAPTCTRLX(index)                    PWMA_CAPTCTRLX_REG(PWMA_BASE_PTR,index)
#define PWMA_CAPTCOMPX(index)                    PWMA_CAPTCOMPX_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL0(index)                        PWMA_CVAL0_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL0CYC(index)                     PWMA_CVAL0CYC_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL1(index)                        PWMA_CVAL1_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL1CYC(index)                     PWMA_CVAL1CYC_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL2(index)                        PWMA_CVAL2_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL2CYC(index)                     PWMA_CVAL2CYC_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL3(index)                        PWMA_CVAL3_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL3CYC(index)                     PWMA_CVAL3CYC_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL4(index)                        PWMA_CVAL4_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL4CYC(index)                     PWMA_CVAL4CYC_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL5(index)                        PWMA_CVAL5_REG(PWMA_BASE_PTR,index)
#define PWMA_CVAL5CYC(index)                     PWMA_CVAL5CYC_REG(PWMA_BASE_PTR,index)
//#define PWMA_FCTRL(index)                        PWMA_FCTRL_REG(PWMA_BASE_PTR,index)
//#define PWMA_FSTS(index)                         PWMA_FSTS_REG(PWMA_BASE_PTR,index)
//#define PWMA_FFILT(index)                        PWMA_FFILT_REG(PWMA_BASE_PTR,index)
//#define PWMA_FTST(index)                         PWMA_FTST_REG(PWMA_BASE_PTR,index)
//#define PWMA_FCTRL2(index)                       PWMA_FCTRL2_REG(PWMA_BASE_PTR,index)

/*!
 * @}
 */ /* end of group PWMA_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group PWMA_Peripheral */


/* ----------------------------------------------------------------------------
   -- RCM
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Peripheral RCM
 * @{
 */

/** RCM - Peripheral register structure */
typedef struct RCM_MemMap {
  uint8_t SRS0;                                    /**< System Reset Status Register 0, offset: 0x0 */
  uint8_t SRS1;                                    /**< System Reset Status Register 1, offset: 0x1 */
  uint8_t RESERVED_0[2];
  uint8_t RPFC;                                    /**< Reset Pin Filter Control register, offset: 0x4 */
  uint8_t RPFW;                                    /**< Reset Pin Filter Width register, offset: 0x5 */
  uint8_t RESERVED_1[2];
  uint8_t SSRS0;                                   /**< Sticky System Reset Status Register 0, offset: 0x8 */
  uint8_t SSRS1;                                   /**< Sticky System Reset Status Register 1, offset: 0x9 */
} volatile *RCM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- RCM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Register_Accessor_Macros RCM - Register accessor macros
 * @{
 */


/* RCM - Register accessors */
#define RCM_SRS0_REG(base)                       ((base)->SRS0)
#define RCM_SRS1_REG(base)                       ((base)->SRS1)
#define RCM_RPFC_REG(base)                       ((base)->RPFC)
#define RCM_RPFW_REG(base)                       ((base)->RPFW)
#define RCM_SSRS0_REG(base)                      ((base)->SSRS0)
#define RCM_SSRS1_REG(base)                      ((base)->SSRS1)

/*!
 * @}
 */ /* end of group RCM_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- RCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup RCM_Register_Masks RCM Register Masks
 * @{
 */

