Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
/* PMPROT Bit Fields */
#define SMC_PMPROT_AVLLS_MASK                    0x2u
#define SMC_PMPROT_AVLLS_SHIFT                   1
#define SMC_PMPROT_AVLP_MASK                     0x20u
#define SMC_PMPROT_AVLP_SHIFT                    5
#define SMC_PMPROT_AHSRUN_MASK                   0x80u
#define SMC_PMPROT_AHSRUN_SHIFT                  7
/* PMCTRL Bit Fields */
#define SMC_PMCTRL_STOPM_MASK                    0x7u
#define SMC_PMCTRL_STOPM_SHIFT                   0
#define SMC_PMCTRL_STOPM(x)                      (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_STOPM_SHIFT))&SMC_PMCTRL_STOPM_MASK)
#define SMC_PMCTRL_STOPA_MASK                    0x8u
#define SMC_PMCTRL_STOPA_SHIFT                   3
#define SMC_PMCTRL_RUNM_MASK                     0x60u
#define SMC_PMCTRL_RUNM_SHIFT                    5
#define SMC_PMCTRL_RUNM(x)                       (((uint8_t)(((uint8_t)(x))<<SMC_PMCTRL_RUNM_SHIFT))&SMC_PMCTRL_RUNM_MASK)
/* STOPCTRL Bit Fields */
#define SMC_STOPCTRL_VLLSM_MASK                  0x7u
#define SMC_STOPCTRL_VLLSM_SHIFT                 0
#define SMC_STOPCTRL_VLLSM(x)                    (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_VLLSM_SHIFT))&SMC_STOPCTRL_VLLSM_MASK)
#define SMC_STOPCTRL_LPOPO_MASK                  0x8u
#define SMC_STOPCTRL_LPOPO_SHIFT                 3
#define SMC_STOPCTRL_PORPO_MASK                  0x20u
#define SMC_STOPCTRL_PORPO_SHIFT                 5
#define SMC_STOPCTRL_PSTOPO_MASK                 0xC0u
#define SMC_STOPCTRL_PSTOPO_SHIFT                6
#define SMC_STOPCTRL_PSTOPO(x)                   (((uint8_t)(((uint8_t)(x))<<SMC_STOPCTRL_PSTOPO_SHIFT))&SMC_STOPCTRL_PSTOPO_MASK)
/* PMSTAT Bit Fields */
#define SMC_PMSTAT_PMSTAT_MASK                   0xFFu
#define SMC_PMSTAT_PMSTAT_SHIFT                  0
#define SMC_PMSTAT_PMSTAT(x)                     (((uint8_t)(((uint8_t)(x))<<SMC_PMSTAT_PMSTAT_SHIFT))&SMC_PMSTAT_PMSTAT_MASK)

/*!
 * @}
 */ /* end of group SMC_Register_Masks */


/* SMC - Peripheral instance base addresses */
/** Peripheral SMC base pointer */
#define SMC_BASE_PTR                             ((SMC_MemMapPtr)0x4007E000u)
/** Array initializer of SMC peripheral base pointers */
#define SMC_BASE_PTRS                            { SMC_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- SMC - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMC_Register_Accessor_Macros SMC - Register accessor macros
 * @{
 */


/* SMC - Register instance definitions */
/* SMC */
#define SMC_PMPROT                               SMC_PMPROT_REG(SMC_BASE_PTR)
#define SMC_PMCTRL                               SMC_PMCTRL_REG(SMC_BASE_PTR)
#define SMC_STOPCTRL                             SMC_STOPCTRL_REG(SMC_BASE_PTR)
#define SMC_PMSTAT                               SMC_PMSTAT_REG(SMC_BASE_PTR)

/*!
 * @}
 */ /* end of group SMC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group SMC_Peripheral */


/* ----------------------------------------------------------------------------
   -- SMPU
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMPU_Peripheral SMPU
 * @{
 */

/** SMPU - Peripheral register structure */
typedef struct SMPU_MemMap {
  uint32_t CESR;                                   /**< Control/Error Status Register, offset: 0x0 */
  uint8_t RESERVED_0[12];
  struct {                                         /* offset: 0x10, array step: 0x8 */
    uint32_t EAR;                                    /**< Error Address Register, Slave Port n, array offset: 0x10, array step: 0x8 */
    uint32_t EDR;                                    /**< Error Detail Register, Slave Port n, array offset: 0x14, array step: 0x8 */
  } SP[4];
  uint8_t RESERVED_1[976];
  uint32_t WORD[8][4];                             /**< Region Descriptor 0, Word 0..Region Descriptor 7, Word 3, array offset: 0x400, array step: index*0x10, index2*0x4 */
} volatile *SMPU_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- SMPU - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMPU_Register_Accessor_Macros SMPU - Register accessor macros
 * @{
 */


/* SMPU - Register accessors */
#define SMPU_CESR_REG(base)                      ((base)->CESR)
#define SMPU_EAR_REG(base,index)                 ((base)->SP[index].EAR)
#define SMPU_EDR_REG(base,index)                 ((base)->SP[index].EDR)
#define SMPU_WORD_REG(base,index,index2)         ((base)->WORD[index][index2])

/*!
 * @}
 */ /* end of group SMPU_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- SMPU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SMPU_Register_Masks SMPU Register Masks
 * @{
 */

/* CESR Bit Fields */
#define SMPU_CESR_VLD_MASK                       0x1u
#define SMPU_CESR_VLD_SHIFT                      0
#define SMPU_CESR_NRGD_MASK                      0xF00u
#define SMPU_CESR_NRGD_SHIFT                     8
#define SMPU_CESR_NRGD(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_CESR_NRGD_SHIFT))&SMPU_CESR_NRGD_MASK)
#define SMPU_CESR_NSP_MASK                       0xF000u
#define SMPU_CESR_NSP_SHIFT                      12
#define SMPU_CESR_NSP(x)                         (((uint32_t)(((uint32_t)(x))<<SMPU_CESR_NSP_SHIFT))&SMPU_CESR_NSP_MASK)
#define SMPU_CESR_HRL_MASK                       0xF0000u
#define SMPU_CESR_HRL_SHIFT                      16
#define SMPU_CESR_HRL(x)                         (((uint32_t)(((uint32_t)(x))<<SMPU_CESR_HRL_SHIFT))&SMPU_CESR_HRL_MASK)
#define SMPU_CESR_SPERR_MASK                     0xF0000000u
#define SMPU_CESR_SPERR_SHIFT                    28
#define SMPU_CESR_SPERR(x)                       (((uint32_t)(((uint32_t)(x))<<SMPU_CESR_SPERR_SHIFT))&SMPU_CESR_SPERR_MASK)
/* EAR Bit Fields */
#define SMPU_EAR_EADDR_MASK                      0xFFFFFFFFu
#define SMPU_EAR_EADDR_SHIFT                     0
#define SMPU_EAR_EADDR(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_EAR_EADDR_SHIFT))&SMPU_EAR_EADDR_MASK)
/* EDR Bit Fields */
#define SMPU_EDR_ERW_MASK                        0x1u
#define SMPU_EDR_ERW_SHIFT                       0
#define SMPU_EDR_EATTR_MASK                      0xEu
#define SMPU_EDR_EATTR_SHIFT                     1
#define SMPU_EDR_EATTR(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_EDR_EATTR_SHIFT))&SMPU_EDR_EATTR_MASK)
#define SMPU_EDR_EMN_MASK                        0xF0u
#define SMPU_EDR_EMN_SHIFT                       4
#define SMPU_EDR_EMN(x)                          (((uint32_t)(((uint32_t)(x))<<SMPU_EDR_EMN_SHIFT))&SMPU_EDR_EMN_MASK)
#define SMPU_EDR_EACD_MASK                       0xFF000000u
#define SMPU_EDR_EACD_SHIFT                      24
#define SMPU_EDR_EACD(x)                         (((uint32_t)(((uint32_t)(x))<<SMPU_EDR_EACD_SHIFT))&SMPU_EDR_EACD_MASK)
/* WORD Bit Fields */
#define SMPU_WORD_VLD_MASK                       0x1u
#define SMPU_WORD_VLD_SHIFT                      0
#define SMPU_WORD_M0UM_MASK                      0x7u
#define SMPU_WORD_M0UM_SHIFT                     0
#define SMPU_WORD_M0UM(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_M0UM_SHIFT))&SMPU_WORD_M0UM_MASK)
#define SMPU_WORD_M0SM_MASK                      0x18u
#define SMPU_WORD_M0SM_SHIFT                     3
#define SMPU_WORD_M0SM(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_M0SM_SHIFT))&SMPU_WORD_M0SM_MASK)
#define SMPU_WORD_M1UM_MASK                      0x1C0u
#define SMPU_WORD_M1UM_SHIFT                     6
#define SMPU_WORD_M1UM(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_M1UM_SHIFT))&SMPU_WORD_M1UM_MASK)
#define SMPU_WORD_ENDADDR_MASK                   0x1FFF00u
#define SMPU_WORD_ENDADDR_SHIFT                  8
#define SMPU_WORD_ENDADDR(x)                     (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_ENDADDR_SHIFT))&SMPU_WORD_ENDADDR_MASK)
#define SMPU_WORD_SRTADDR_MASK                   0x1FFF00u
#define SMPU_WORD_SRTADDR_SHIFT                  8
#define SMPU_WORD_SRTADDR(x)                     (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_SRTADDR_SHIFT))&SMPU_WORD_SRTADDR_MASK)
#define SMPU_WORD_M1SM_MASK                      0x600u
#define SMPU_WORD_M1SM_SHIFT                     9
#define SMPU_WORD_M1SM(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_M1SM_SHIFT))&SMPU_WORD_M1SM_MASK)
#define SMPU_WORD_M2UM_MASK                      0x7000u
#define SMPU_WORD_M2UM_SHIFT                     12
#define SMPU_WORD_M2UM(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_M2UM_SHIFT))&SMPU_WORD_M2UM_MASK)
#define SMPU_WORD_M2SM_MASK                      0x18000u
#define SMPU_WORD_M2SM_SHIFT                     15
#define SMPU_WORD_M2SM(x)                        (((uint32_t)(((uint32_t)(x))<<SMPU_WORD_M2SM_SHIFT))&SMPU_WORD_M2SM_MASK)

/*!
 * @}
 */ /* end of group SMPU_Register_Masks */


