Kinetis/AN2295_Bootloader/app/KV4x-app/src/platforms/MKV46F15 - 副本.h
/* XBARA - Peripheral instance base addresses */
/** Peripheral XBARA base pointer */
#define XBARA_BASE_PTR                           ((XBARA_MemMapPtr)0x40059000u)
/** Array initializer of XBARA peripheral base pointers */
#define XBARA_BASE_PTRS                          { XBARA_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- XBARA - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARA_Register_Accessor_Macros XBARA - Register accessor macros
 * @{
 */


/* XBARA - Register instance definitions */
/* XBARA */
#define XBARA_SEL0                               XBARA_SEL0_REG(XBARA_BASE_PTR)
#define XBARA_SEL1                               XBARA_SEL1_REG(XBARA_BASE_PTR)
#define XBARA_SEL2                               XBARA_SEL2_REG(XBARA_BASE_PTR)
#define XBARA_SEL3                               XBARA_SEL3_REG(XBARA_BASE_PTR)
#define XBARA_SEL4                               XBARA_SEL4_REG(XBARA_BASE_PTR)
#define XBARA_SEL5                               XBARA_SEL5_REG(XBARA_BASE_PTR)
#define XBARA_SEL6                               XBARA_SEL6_REG(XBARA_BASE_PTR)
#define XBARA_SEL7                               XBARA_SEL7_REG(XBARA_BASE_PTR)
#define XBARA_SEL8                               XBARA_SEL8_REG(XBARA_BASE_PTR)
#define XBARA_SEL9                               XBARA_SEL9_REG(XBARA_BASE_PTR)
#define XBARA_SEL10                              XBARA_SEL10_REG(XBARA_BASE_PTR)
#define XBARA_SEL11                              XBARA_SEL11_REG(XBARA_BASE_PTR)
#define XBARA_SEL12                              XBARA_SEL12_REG(XBARA_BASE_PTR)
#define XBARA_SEL13                              XBARA_SEL13_REG(XBARA_BASE_PTR)
#define XBARA_SEL14                              XBARA_SEL14_REG(XBARA_BASE_PTR)
#define XBARA_SEL15                              XBARA_SEL15_REG(XBARA_BASE_PTR)
#define XBARA_SEL16                              XBARA_SEL16_REG(XBARA_BASE_PTR)
#define XBARA_SEL17                              XBARA_SEL17_REG(XBARA_BASE_PTR)
#define XBARA_SEL18                              XBARA_SEL18_REG(XBARA_BASE_PTR)
#define XBARA_SEL19                              XBARA_SEL19_REG(XBARA_BASE_PTR)
#define XBARA_SEL20                              XBARA_SEL20_REG(XBARA_BASE_PTR)
//per b48623 on 6may
#define XBARA_SEL21                              XBARA_SEL21_REG(XBARA_BASE_PTR)
#define XBARA_SEL22                              XBARA_SEL22_REG(XBARA_BASE_PTR)
#define XBARA_SEL23                              XBARA_SEL23_REG(XBARA_BASE_PTR)
#define XBARA_SEL24                              XBARA_SEL24_REG(XBARA_BASE_PTR)
#define XBARA_SEL25                              XBARA_SEL25_REG(XBARA_BASE_PTR)
#define XBARA_SEL26                              XBARA_SEL26_REG(XBARA_BASE_PTR)
#define XBARA_SEL27                              XBARA_SEL27_REG(XBARA_BASE_PTR)
#define XBARA_SEL28                              XBARA_SEL28_REG(XBARA_BASE_PTR)
#define XBARA_SEL29                              XBARA_SEL29_REG(XBARA_BASE_PTR)
#define XBARA_CTRL0                              XBARA_CTRL0_REG(XBARA_BASE_PTR)
#define XBARA_CTRL1                              XBARA_CTRL1_REG(XBARA_BASE_PTR)

/*!
 * @}
 */ /* end of group XBARA_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group XBARA_Peripheral */


/* ----------------------------------------------------------------------------
   -- XBARB
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Peripheral XBARB
 * @{
 */

/** XBARB - Peripheral register structure */
typedef struct XBARB_MemMap {
  uint16_t SEL0;                                   /**< Crossbar B Select Register 0, offset: 0x0 */
  uint16_t SEL1;                                   /**< Crossbar B Select Register 1, offset: 0x2 */
  uint16_t SEL2;                                   /**< Crossbar B Select Register 2, offset: 0x4 */
  uint16_t SEL3;                                   /**< Crossbar B Select Register 3, offset: 0x6 */
  uint16_t SEL4;                                   /**< Crossbar B Select Register 4, offset: 0x8 */
  uint16_t SEL5;                                   /**< Crossbar B Select Register 5, offset: 0xA */
  uint16_t SEL6;                                   /**< Crossbar B Select Register 6, offset: 0xC */
  uint16_t SEL7;                                   /**< Crossbar B Select Register 7, offset: 0xE */
} volatile *XBARB_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- XBARB - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Accessor_Macros XBARB - Register accessor macros
 * @{
 */


/* XBARB - Register accessors */
#define XBARB_SEL0_REG(base)                     ((base)->SEL0)
#define XBARB_SEL1_REG(base)                     ((base)->SEL1)
#define XBARB_SEL2_REG(base)                     ((base)->SEL2)
#define XBARB_SEL3_REG(base)                     ((base)->SEL3)
#define XBARB_SEL4_REG(base)                     ((base)->SEL4)
#define XBARB_SEL5_REG(base)                     ((base)->SEL5)
#define XBARB_SEL6_REG(base)                     ((base)->SEL6)
#define XBARB_SEL7_REG(base)                     ((base)->SEL7)

/*!
 * @}
 */ /* end of group XBARB_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- XBARB Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Masks XBARB Register Masks
 * @{
 */

/* SEL0 Bit Fields */
#define XBARB_SEL0_SEL0_MASK                     0x1Fu
#define XBARB_SEL0_SEL0_SHIFT                    0
#define XBARB_SEL0_SEL0(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL0_SEL0_SHIFT))&XBARB_SEL0_SEL0_MASK)
#define XBARB_SEL0_SEL1_MASK                     0x1F00u
#define XBARB_SEL0_SEL1_SHIFT                    8
#define XBARB_SEL0_SEL1(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL0_SEL1_SHIFT))&XBARB_SEL0_SEL1_MASK)
/* SEL1 Bit Fields */
#define XBARB_SEL1_SEL2_MASK                     0x1Fu
#define XBARB_SEL1_SEL2_SHIFT                    0
#define XBARB_SEL1_SEL2(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL1_SEL2_SHIFT))&XBARB_SEL1_SEL2_MASK)
#define XBARB_SEL1_SEL3_MASK                     0x1F00u
#define XBARB_SEL1_SEL3_SHIFT                    8
#define XBARB_SEL1_SEL3(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL1_SEL3_SHIFT))&XBARB_SEL1_SEL3_MASK)
/* SEL2 Bit Fields */
#define XBARB_SEL2_SEL4_MASK                     0x1Fu
#define XBARB_SEL2_SEL4_SHIFT                    0
#define XBARB_SEL2_SEL4(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL2_SEL4_SHIFT))&XBARB_SEL2_SEL4_MASK)
#define XBARB_SEL2_SEL5_MASK                     0x1F00u
#define XBARB_SEL2_SEL5_SHIFT                    8
#define XBARB_SEL2_SEL5(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL2_SEL5_SHIFT))&XBARB_SEL2_SEL5_MASK)
/* SEL3 Bit Fields */
#define XBARB_SEL3_SEL6_MASK                     0x1Fu
#define XBARB_SEL3_SEL6_SHIFT                    0
#define XBARB_SEL3_SEL6(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL3_SEL6_SHIFT))&XBARB_SEL3_SEL6_MASK)
#define XBARB_SEL3_SEL7_MASK                     0x1F00u
#define XBARB_SEL3_SEL7_SHIFT                    8
#define XBARB_SEL3_SEL7(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL3_SEL7_SHIFT))&XBARB_SEL3_SEL7_MASK)
/* SEL4 Bit Fields */
#define XBARB_SEL4_SEL8_MASK                     0x1Fu
#define XBARB_SEL4_SEL8_SHIFT                    0
#define XBARB_SEL4_SEL8(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL4_SEL8_SHIFT))&XBARB_SEL4_SEL8_MASK)
#define XBARB_SEL4_SEL9_MASK                     0x1F00u
#define XBARB_SEL4_SEL9_SHIFT                    8
#define XBARB_SEL4_SEL9(x)                       (((uint16_t)(((uint16_t)(x))<<XBARB_SEL4_SEL9_SHIFT))&XBARB_SEL4_SEL9_MASK)
/* SEL5 Bit Fields */
#define XBARB_SEL5_SEL10_MASK                    0x1Fu
#define XBARB_SEL5_SEL10_SHIFT                   0
#define XBARB_SEL5_SEL10(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL5_SEL10_SHIFT))&XBARB_SEL5_SEL10_MASK)
#define XBARB_SEL5_SEL11_MASK                    0x1F00u
#define XBARB_SEL5_SEL11_SHIFT                   8
#define XBARB_SEL5_SEL11(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL5_SEL11_SHIFT))&XBARB_SEL5_SEL11_MASK)
/* SEL6 Bit Fields */
#define XBARB_SEL6_SEL12_MASK                    0x1Fu
#define XBARB_SEL6_SEL12_SHIFT                   0
#define XBARB_SEL6_SEL12(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL6_SEL12_SHIFT))&XBARB_SEL6_SEL12_MASK)
#define XBARB_SEL6_SEL13_MASK                    0x1F00u
#define XBARB_SEL6_SEL13_SHIFT                   8
#define XBARB_SEL6_SEL13(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL6_SEL13_SHIFT))&XBARB_SEL6_SEL13_MASK)
/* SEL7 Bit Fields */
#define XBARB_SEL7_SEL14_MASK                    0x1Fu
#define XBARB_SEL7_SEL14_SHIFT                   0
#define XBARB_SEL7_SEL14(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL7_SEL14_SHIFT))&XBARB_SEL7_SEL14_MASK)
#define XBARB_SEL7_SEL15_MASK                    0x1F00u
#define XBARB_SEL7_SEL15_SHIFT                   8
#define XBARB_SEL7_SEL15(x)                      (((uint16_t)(((uint16_t)(x))<<XBARB_SEL7_SEL15_SHIFT))&XBARB_SEL7_SEL15_MASK)

/*!
 * @}
 */ /* end of group XBARB_Register_Masks */


/* XBARB - Peripheral instance base addresses */
/** Peripheral XBARB base pointer */
#define XBARB_BASE_PTR                           ((XBARB_MemMapPtr)0x4005A000u)
/** Array initializer of XBARB peripheral base pointers */
#define XBARB_BASE_PTRS                          { XBARB_BASE_PTR }

/* ----------------------------------------------------------------------------
   -- XBARB - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBARB_Register_Accessor_Macros XBARB - Register accessor macros
 * @{
 */


